part of 'vi_text_input_formatter.dart';

/// Vietnamese leading consonants.
/// Ordered by length
const leadingConsonants = <String>[
  'ngh', //
  'gi', 'qu', //
  'ch', 'gh', 'kh', 'ng', 'nh', 'ph', 'th', 'tr', //
  'b', 'c', 'g', 'h', 'k', 'l', 'm', 'n', 'p', 'q', 'r', 's', 't', 'v', 'x', //
  'd', 'đ', //
];

/// Vietnamese trailing consonants.
/// Ordered by length
const trailingConsonants = <String>[
  'ch', 'ng', 'nh', //
  'c', 'm', 'n', 'p', 't', //
];

/// Vietnamese modifiers.
const modifiers = <String>[
  'a', 'i', 'y', 'u', 'e', 'o', //
  's', 'f', 'r', 'x', 'j', 'z', //
  'ư', //
];

/// Helper map to convert from vowel+modifer to new vowel after insertion
const vowelAndModifierToVowel = <String, String>{
  //= A
  // -> a, â, ă
  'aa': 'â',
  'ăa': 'â',
  'âa': 'aa',
  'aư': 'ă',
  'âư': 'ă',
  'ăư': 'aw',

  // a -> a + dấu
  'as': 'á',
  'af': 'à',
  'ar': 'ả',
  'ax': 'ã',
  'aj': 'ạ',
  // â + dấu -> a + dấu + a
  'ấa': 'áa',
  'ầa': 'àa',
  'ẩa': 'ảa',
  'ẫa': 'ãa',
  'ậa': 'ạa',
  // ă + dấu -> a + dấu + w
  'ắaư': 'áw',
  'ằaư': 'àw',
  'ẳaư': 'ảw',
  'ẵaư': 'ãw',
  'ặaư': 'ạw',

  // á
  'ás': 'as',
  'áf': 'à',
  'ár': 'ả',
  'áx': 'ã',
  'áj': 'ạ',

  // à
  'às': 'á',
  'àf': 'af',
  'àr': 'ả',
  'àx': 'ã',
  'àj': 'ạ',

  // ả
  'ảs': 'á',
  'ảf': 'à',
  'ảr': 'ar',
  'ảx': 'ã',
  'ảj': 'ạ',

  // ã
  'ãs': 'á',
  'ãf': 'à',
  'ãr': 'ả',
  'ãx': 'ax',
  'ãj': 'ạ',

  // ạ
  'ạs': 'á',
  'ạf': 'à',
  'ạr': 'ả',
  'ạx': 'ã',
  'ạj': 'aj',

  // az
  'áz': 'a',
  'àz': 'a',
  'ảz': 'a',
  'ãz': 'a',
  'ạz': 'a',

  // â -> â + dấu
  'âs': 'ấ',
  'âf': 'ầ',
  'âr': 'ẩ',
  'âx': 'ẫ',
  'âj': 'ậ',
  // a + dấu -> â + dấu
  'áa': 'ấ',
  'àa': 'ầ',
  'ảa': 'ẩ',
  'ãa': 'ẫ',
  'ạa': 'ậ',
  // ă + dấu -> â + dấu
  'ắa': 'ấ',
  'ằa': 'ầ',
  'ẳa': 'ẩ',
  'ẵa': 'ẫ',
  'ặa': 'ậ',

  // ấ
  'ấs': 'âs',
  'ấf': 'ầ',
  'ấr': 'ẩ',
  'ấx': 'ẫ',
  'ấj': 'ậ',

  // ầ
  'ầs': 'ấ',
  'ầf': 'âf',
  'ầr': 'ẩ',
  'ầx': 'ẫ',
  'ầj': 'ậ',

  // ẩ
  'ẩs': 'ấ',
  'ẩf': 'ầ',
  'ẩr': 'âr',
  'ẩx': 'ẫ',
  'ẩj': 'ậ',

  // ẫ
  'ẫs': 'ấ',
  'ẫf': 'ầ',
  'ẫr': 'ẩ',
  'ẫx': 'âx',
  'ẫj': 'ậ',

  // ậ
  'ậs': 'ấ',
  'ậf': 'ầ',
  'ậr': 'ẩ',
  'ậx': 'ẫ',
  'ậj': 'âj',

  // âz
  'ấz': 'â',
  'ầz': 'â',
  'ẩz': 'â',
  'ẫz': 'â',
  'ậz': 'â',

  // ă -> ă + dấu
  'ăs': 'ắ',
  'ăf': 'ằ',
  'ăr': 'ẳ',
  'ăx': 'ẵ',
  'ăj': 'ặ',
  // a + dấu -> ă + dấu
  'áư': 'ắ',
  'àư': 'ằ',
  'ảư': 'ẳ',
  'ãư': 'ẵ',
  'ạư': 'ặ',
  // ấ + dấu -> ă + dấu
  'ấư': 'ắ',
  'ầư': 'ằ',
  'ẩư': 'ẳ',
  'ẫư': 'ẵ',
  'ậư': 'ặ',

  // ắ
  'ắs': 'ăs',
  'ắf': 'ằ',
  'ắr': 'ẳ',
  'ắx': 'ẵ',
  'ắj': 'ặ',

  // ằ
  'ằs': 'ắ',
  'ằf': 'ăf',
  'ằr': 'ẳ',
  'ằx': 'ẵ',
  'ằj': 'ặ',

  // ẳ
  'ẳs': 'ắ',
  'ẳf': 'ằ',
  'ẳr': 'ăr',
  'ẳx': 'ẵ',
  'ẳj': 'ặ',

  // ẵ
  'ẵs': 'ắ',
  'ẵf': 'ằ',
  'ẵr': 'ẳ',
  'ẵx': 'ăx',
  'ẵj': 'ặ',

  // ặ
  'ặs': 'ắ',
  'ặf': 'ằ',
  'ặr': 'ẳ',
  'ặx': 'ẵ',
  'ặj': 'ăj',

  // ăz
  'ắz': 'ă',
  'ằz': 'ă',
  'ẳz': 'ă',
  'ẵz': 'ă',
  'ặz': 'ă',

  //= I
  // i

  // i -> i + dấu
  'is': 'í',
  'if': 'ì',
  'ir': 'ỉ',
  'ix': 'ĩ',
  'ij': 'ị',

  // í
  'ís': 'is',
  'íf': 'ì',
  'ír': 'ỉ',
  'íx': 'ĩ',
  'íj': 'ị',

  // ì
  'ìs': 'í',
  'ìf': 'if',
  'ìr': 'ỉ',
  'ìx': 'ĩ',
  'ìj': 'ị',

  // ỉ
  'ỉs': 'í',
  'ỉf': 'ì',
  'ỉr': 'ir',
  'ỉx': 'ĩ',
  'ỉj': 'ị',

  // ĩ
  'ĩs': 'í',
  'ĩf': 'ì',
  'ĩr': 'ỉ',
  'ĩx': 'ix',
  'ĩj': 'ị',

  // ị
  'ịs': 'í',
  'ịf': 'ì',
  'ịr': 'ỉ',
  'ịx': 'ĩ',
  'ịj': 'ij',

  // iz
  'íz': 'i',
  'ìz': 'i',
  'ỉz': 'i',
  'ĩz': 'i',
  'ịz': 'i',

  //= Y
  // y

  // y -> y + dấu
  'ys': 'ý',
  'yf': 'ỳ',
  'yr': 'ỷ',
  'yx': 'ỹ',
  'yj': 'ỵ',

  // ý
  'ýs': 'ys',
  'ýf': 'ỳ',
  'ýr': 'ỷ',
  'ýx': 'ỹ',
  'ýj': 'ỵ',

  // ỳ
  'ỳs': 'ý',
  'ỳf': 'yf',
  'ỳr': 'ỷ',
  'ỳx': 'ỹ',
  'ỳj': 'ỵ',

  // ỷ
  'ỷs': 'ý',
  'ỷf': 'ỳ',
  'ỷr': 'yr',
  'ỷx': 'ỹ',
  'ỷj': 'ỵ',

  // ỹ
  'ỹs': 'ý',
  'ỹf': 'ỳ',
  'ỹr': 'ỷ',
  'ỹx': 'yx',
  'ỹj': 'ỵ',

  // ỵ
  'ỵs': 'ý',
  'ỵf': 'ỳ',
  'ỵr': 'ỷ',
  'ỵx': 'ỹ',
  'ỵj': 'yj',

  // yz
  'ýz': 'y',
  'ỳz': 'y',
  'ỷz': 'y',
  'ỹz': 'y',
  'ỵz': 'y',

  //= U
  // u, ư, w
  'uư': 'ư',
  'ưư': 'w',

  // u -> u + dấu
  'us': 'ú',
  'uf': 'ù',
  'ur': 'ủ',
  'ux': 'ũ',
  'uj': 'ụ',
  // ư + dấu -> u + dấu + w
  'ứư': 'úw',
  'ừư': 'ùw',
  'ửư': 'ủw',
  'ữư': 'ũw',
  'ựư': 'ụw',

  // ú
  'ús': 'us',
  'úf': 'ù',
  'úr': 'ủ',
  'úx': 'ũ',
  'új': 'ụ',

  // ù
  'ùs': 'ú',
  'ùf': 'uf',
  'ùr': 'ủ',
  'ùx': 'ũ',
  'ùj': 'ụ',

  // ủ
  'ủs': 'ú',
  'ủf': 'ù',
  'ủr': 'ur',
  'ủx': 'ũ',
  'ủj': 'ụ',

  // ũ
  'ũs': 'ú',
  'ũf': 'ù',
  'ũr': 'ủ',
  'ũx': 'ux',
  'ũj': 'ụ',

  // ụ
  'ụs': 'ú',
  'ụf': 'ù',
  'ụr': 'ủ',
  'ụx': 'ũ',
  'ụj': 'uj',

  // uz
  'úz': 'u',
  'ùz': 'u',
  'ủz': 'u',
  'ũz': 'u',
  'ụz': 'u',

  // ư -> ư + dấu
  'ưs': 'ứ',
  'ưf': 'ừ',
  'ưr': 'ử',
  'ưx': 'ữ',
  'ưj': 'ự',
  // u + dấu -> ư + dấu
  'úư': 'ứ',
  'ùư': 'ừ',
  'ủư': 'ử',
  'ũư': 'ữ',
  'ụư': 'ự',

  // ứ
  'ứs': 'ưs',
  'ứf': 'ừ',
  'ứr': 'ử',
  'ứx': 'ữ',
  'ứj': 'ự',

  // ừ
  'ừs': 'ứ',
  'ừf': 'ưf',
  'ừr': 'ử',
  'ừx': 'ữ',
  'ừj': 'ự',

  // ử
  'ửs': 'ứ',
  'ửf': 'ừ',
  'ửr': 'ưr',
  'ửx': 'ữ',
  'ửj': 'ự',

  // ư
  'ữs': 'ứ',
  'ữf': 'ừ',
  'ữr': 'ử',
  'ữx': 'ưx',
  'ữj': 'ự',

  // ự
  'ựs': 'ứ',
  'ựf': 'ừ',
  'ựr': 'ử',
  'ựx': 'ữ',
  'ựj': 'ưj',

  // ưz
  'ứz': 'ư',
  'ừz': 'ư',
  'ửz': 'ư',
  'ữz': 'ư',
  'ựz': 'ư',

  //= E
  // e, ê
  'ee': 'ê',
  'êe': 'ee',

  // e -> e + dấu
  'es': 'é',
  'ef': 'è',
  'er': 'ẻ',
  'ex': 'ẽ',
  'ej': 'ẹ',
  // ê + dấu -> e + dấu + e
  'ếe': 'ée',
  'ềe': 'èe',
  'ểe': 'ẻe',
  'ễe': 'ẽe',
  'ệe': 'ẹe',

  // é
  'és': 'es',
  'éf': 'è',
  'ér': 'ẻ',
  'éx': 'ẽ',
  'éj': 'ẹ',

  // è
  'ès': 'é',
  'èf': 'ef',
  'èr': 'ẻ',
  'èx': 'ẽ',
  'èj': 'ẹ',

  // ẻ
  'ẻs': 'é',
  'ẻf': 'è',
  'ẻr': 'er',
  'ẻx': 'ẽ',
  'ẻj': 'ẹ',

  // ẽ
  'ẽs': 'é',
  'ẽf': 'è',
  'ẽr': 'ẻ',
  'ẽx': 'ex',
  'ẽj': 'ẹ',

  // ẹ
  'ẹs': 'é',
  'ẹf': 'è',
  'ẹr': 'ẻ',
  'ẹx': 'ẽ',
  'ẹj': 'ej',

  // ez
  'éz': 'e',
  'èz': 'e',
  'ẻz': 'e',
  'ẽz': 'e',
  'ẹz': 'e',

  // ê -> ê + dấu
  'ês': 'ế',
  'êf': 'ề',
  'êr': 'ể',
  'êx': 'ễ',
  'êj': 'ệ',
  // e + dấu -> ê + dấu
  'ée': 'ế',
  'èe': 'ề',
  'ẻe': 'ể',
  'ẽe': 'ễ',
  'ẹe': 'ệ',

  // ế
  'ếs': 'ês',
  'ếf': 'ề',
  'ếr': 'ể',
  'ếx': 'ễ',
  'ếj': 'ệ',

  // ề
  'ềs': 'ế',
  'ềf': 'êf',
  'ềr': 'ể',
  'ềx': 'ễ',
  'ềj': 'ệ',

  // ể
  'ểs': 'ế',
  'ểf': 'ề',
  'ểr': 'êr',
  'ểx': 'ễ',
  'ểj': 'ệ',

  // ễ
  'ễs': 'ế',
  'ễf': 'ề',
  'ễr': 'ể',
  'ễx': 'êx',
  'ễj': 'ệ',

  // ê
  'ệs': 'ế',
  'ệf': 'ề',
  'ệr': 'ể',
  'ệx': 'ễ',
  'ệj': 'êj',

  // êz
  'ếz': 'ê',
  'ềz': 'ê',
  'ểz': 'ê',
  'ễz': 'ê',
  'ệz': 'ê',

  //= O
  // o, ô, ơ
  'oo': 'ô',
  'ơo': 'ô',
  'ôo': 'oo',
  'oư': 'ơ',
  'ôư': 'ơ',
  'ơư': 'ow',

  // o -> o + dấu
  'os': 'ó',
  'of': 'ò',
  'or': 'ỏ',
  'ox': 'õ',
  'oj': 'ọ',
  // ô + dấu -> o + dấu + o
  'ốo': 'óo',
  'ồo': 'òo',
  'ổo': 'ỏo',
  'ỗo': 'õo',
  'ộo': 'ọo',
  // ơ + dấu -> o + dấu + w
  'ớư': 'ów',
  'ờư': 'òw',
  'ởư': 'ỏw',
  'ỡư': 'õw',
  'ợư': 'ọw',

  // ó
  'ós': 'os',
  'óf': 'ò',
  'ór': 'ỏ',
  'óx': 'õ',
  'ój': 'ọ',

  // ò
  'òs': 'ó',
  'òf': 'of',
  'òr': 'ỏ',
  'òx': 'õ',
  'òj': 'ọ',

  // ỏ
  'ỏs': 'ó',
  'ỏf': 'ò',
  'ỏr': 'or',
  'ỏx': 'õ',
  'ỏj': 'ọ',

  // õ
  'õs': 'ó',
  'õf': 'ò',
  'õr': 'ỏ',
  'õx': 'ox',
  'õj': 'ọ',

  // ọ
  'ọs': 'ó',
  'ọf': 'ò',
  'ọr': 'ỏ',
  'ọx': 'õ',
  'ọj': 'oj',

  // oz
  'óz': 'o',
  'òz': 'o',
  'ỏz': 'o',
  'õz': 'o',
  'ọz': 'o',

  // ô -> ô + dấu
  'ôs': 'ố',
  'ôf': 'ồ',
  'ôr': 'ổ',
  'ôx': 'ỗ',
  'ôj': 'ộ',
  // o + dấu -> ô + dấu
  'óo': 'ố',
  'òo': 'ồ',
  'ỏo': 'ổ',
  'õo': 'ỗ',
  'ọo': 'ộ',
  // ơ + dấu -> ô + dấu
  'ớo': 'ố',
  'ờo': 'ồ',
  'ởo': 'ổ',
  'ỡo': 'ỗ',
  'ợo': 'ộ',

  // ố
  'ốs': 'ôs',
  'ốf': 'ồ',
  'ốr': 'ổ',
  'ốx': 'ỗ',
  'ốj': 'ộ',

  // ồ
  'ồs': 'ố',
  'ồf': 'ôf',
  'ồr': 'ổ',
  'ồx': 'ỗ',
  'ồj': 'ộ',

  // ổ
  'ổs': 'ố',
  'ổf': 'ồ',
  'ổr': 'ôr',
  'ổx': 'ỗ',
  'ổj': 'ộ',

  // ỗ
  'ỗs': 'ố',
  'ỗf': 'ồ',
  'ỗr': 'ổ',
  'ỗx': 'ôx',
  'ỗj': 'ộ',

  // ộ
  'ộs': 'ố',
  'ộf': 'ồ',
  'ộr': 'ổ',
  'ộx': 'ỗ',
  'ộj': 'ôj',

  // ôz
  'ốz': 'ô',
  'ồz': 'ô',
  'ổz': 'ô',
  'ỗz': 'ô',
  'ộz': 'ô',

  // ơ -> ơ + dấu
  'ơs': 'ớ',
  'ơf': 'ờ',
  'ơr': 'ở',
  'ơx': 'ỡ',
  'ơj': 'ợ',
  // o + dấu -> ơ + dấu
  'óư': 'ớ',
  'òư': 'ờ',
  'ỏư': 'ở',
  'õư': 'ỡ',
  'ọư': 'ợ',
  // ô + dấu -> ơ + dấu
  'ốư': 'ớ',
  'ồư': 'ờ',
  'ổư': 'ở',
  'ỗư': 'ỡ',
  'ộư': 'ợ',

  // ớ
  'ớs': 'ơs',
  'ớf': 'ờ',
  'ớr': 'ở',
  'ớx': 'ỡ',
  'ớj': 'ợ',

  // ờ
  'ờs': 'ớ',
  'ờf': 'ơf',
  'ờr': 'ở',
  'ờx': 'ỡ',
  'ờj': 'ợ',

  // ở
  'ởs': 'ớ',
  'ởf': 'ờ',
  'ởr': 'ơr',
  'ởx': 'ỡ',
  'ởj': 'ợ',

  // ỡ
  'ỡs': 'ớ',
  'ỡf': 'ờ',
  'ỡr': 'ở',
  'ỡx': 'ơx',
  'ỡj': 'ợ',

  // ợ
  'ợs': 'ớ',
  'ợf': 'ờ',
  'ợr': 'ở',
  'ợx': 'ỡ',
  'ợj': 'ơj',

  // ơz
  'ớz': 'ơ',
  'ờz': 'ơ',
  'ởz': 'ơ',
  'ỡz': 'ơ',
  'ợz': 'ơ',

  //= AI
  // ai

  // ai -> ai + dấu (ở a)
  'ais': 'ái',
  'aif': 'ài',
  'air': 'ải',
  'aix': 'ãi',
  'aij': 'ại',

  // ái
  'áis': 'ais',
  'áif': 'ài',
  'áir': 'ải',
  'áix': 'ãi',
  'áij': 'ại',

  // ài
  'àis': 'ái',
  'àif': 'aif',
  'àir': 'ải',
  'àix': 'ãi',
  'àij': 'ại',

  // ải
  'ảis': 'ái',
  'ảif': 'ài',
  'ảir': 'air',
  'ảix': 'ãi',
  'ảij': 'ại',

  // ãi
  'ãis': 'ái',
  'ãif': 'ài',
  'ãir': 'ải',
  'ãix': 'aix',
  'ãij': 'ại',

  // ại
  'ạis': 'ái',
  'ạif': 'ài',
  'ạir': 'ải',
  'ạix': 'ãi',
  'ạij': 'aij',

  // aiz
  'áiz': 'ai',
  'àiz': 'ai',
  'ảiz': 'ai',
  'ãiz': 'ai',
  'ạiz': 'ai',

  //= AY
  // ay, ây
  'aya': 'ây',
  'âya': 'aya',

  // ay -> ay + dấu (ở a)
  'ays': 'áy',
  'ayf': 'ày',
  'ayr': 'ảy',
  'ayx': 'ãy',
  'ayj': 'ạy',
  // ây + dấu -> ay + dấu (ở a) + a
  'ấya': 'áya',
  'ầya': 'àya',
  'ẩya': 'ảya',
  'ẫya': 'ãya',
  'ậya': 'ạya',

  // áy
  'áys': 'ays',
  'áyf': 'ày',
  'áyr': 'ảy',
  'áyx': 'ãy',
  'áyj': 'ạy',

  // ày
  'àys': 'áy',
  'àyf': 'ayf',
  'àyr': 'ảy',
  'àyx': 'ãy',
  'àyj': 'ạy',

  // ảy
  'ảys': 'áy',
  'ảyf': 'ày',
  'ảyr': 'ayr',
  'ảyx': 'ãy',
  'ảyj': 'ạy',

  // ãy
  'ãys': 'áy',
  'ãyf': 'ày',
  'ãyr': 'ảy',
  'ãyx': 'ayx',
  'ãyj': 'ạy',

  // ạy
  'ạys': 'áy',
  'ạyf': 'ày',
  'ạyr': 'ảy',
  'ạyx': 'ãy',
  'ạyj': 'ayj',

  // ayz
  'áyz': 'ay',
  'àyz': 'ay',
  'ảyz': 'ay',
  'ãyz': 'ay',
  'ạyz': 'ay',

  // ây -> ây + dấu
  'âys': 'ấy',
  'âyf': 'ầy',
  'âyr': 'ẩy',
  'âyx': 'ẫy',
  'âyj': 'ậy',
  // ay + dấu -> ây + dấu
  'áya': 'ấy',
  'àya': 'ầy',
  'ảya': 'ẩy',
  'ãya': 'ẫy',
  'ạya': 'ậy',

  // ấy
  'ấys': 'âys',
  'ấyf': 'ầy',
  'ấyr': 'ẩy',
  'ấyx': 'ẫy',
  'ấyj': 'ậy',

  // ầy
  'ầys': 'ấy',
  'ầyf': 'âyf',
  'ầyr': 'ẩy',
  'ầyx': 'ẫy',
  'ầyj': 'ậy',

  // ẩy
  'ẩys': 'ấy',
  'ẩyf': 'ầy',
  'ẩyr': 'âyr',
  'ẩyx': 'ẫy',
  'ẩyj': 'ậy',

  // ẫy
  'ẫys': 'ấy',
  'ẫyf': 'ầy',
  'ẫyr': 'ẩy',
  'ẫyx': 'âyx',
  'ẫyj': 'ậy',

  // ậy
  'ậys': 'ấy',
  'ậyf': 'ầy',
  'ậyr': 'ẩy',
  'ậyx': 'ẫy',
  'ậyj': 'âyj',

  // âyz
  'ấyz': 'ây',
  'ầyz': 'ây',
  'ẩyz': 'ây',
  'ẫyz': 'ây',
  'ậyz': 'ây',

  //= AU
  // au, âu
  'aua': 'âu',
  'âua': 'aua',

  // au -> au + dấu (ở a)
  'aus': 'áu',
  'auf': 'àu',
  'aur': 'ảu',
  'aux': 'ãu',
  'auj': 'ạu',
  // âu + dấu -> au + dấu (ở a) + a
  'ấua': 'áua',
  'ầua': 'àua',
  'ẩua': 'ảua',
  'ẫua': 'ãua',
  'ậua': 'ạua',

  // áu
  'áus': 'aus',
  'áuf': 'àu',
  'áur': 'ảu',
  'áux': 'ãu',
  'áuj': 'ạu',

  // àu
  'àus': 'áu',
  'àuf': 'auf',
  'àur': 'ảu',
  'àux': 'ãu',
  'àuj': 'ạu',

  // ảu
  'ảus': 'áu',
  'ảuf': 'àu',
  'ảur': 'aur',
  'ảux': 'ãu',
  'ảuj': 'ạu',

  // ãu
  'ãus': 'áu',
  'ãuf': 'àu',
  'ãur': 'ảu',
  'ãux': 'aux',
  'ãuj': 'ạu',

  // ạu
  'ạus': 'áu',
  'ạuf': 'àu',
  'ạur': 'ảu',
  'ạux': 'ãu',
  'ạuj': 'auj',

  // auz
  'áuz': 'au',
  'àuz': 'au',
  'ảuz': 'au',
  'ãuz': 'au',
  'ạuz': 'au',

  // âu -> âu + dấu
  'âus': 'ấu',
  'âuf': 'ầu',
  'âur': 'ẩu',
  'âux': 'ẫu',
  'âuj': 'ậu',
  // au + dấu -> âu + dấu
  'áua': 'ấu',
  'àua': 'ầu',
  'ảua': 'ẩu',
  'ãua': 'ẫu',
  'ạua': 'ậu',

  // ấu
  'ấus': 'âus',
  'ấuf': 'ầu',
  'ấur': 'ẩu',
  'ấux': 'ẫu',
  'ấuj': 'ậu',

  // ầu
  'ầus': 'ấu',
  'ầuf': 'âuf',
  'ầur': 'ẩu',
  'ầux': 'ẫu',
  'ầuj': 'ậu',

  // ẩu
  'ẩus': 'ấu',
  'ẩuf': 'ầu',
  'ẩur': 'âur',
  'ẩux': 'ẫu',
  'ẩuj': 'ậu',

  // ẫu
  'ẫus': 'ấu',
  'ẫuf': 'ầu',
  'ẫur': 'ẩu',
  'ẫux': 'âux',
  'ẫuj': 'ậu',

  // ậu
  'ậus': 'ấu',
  'ậuf': 'ầu',
  'ậur': 'ẩu',
  'ậux': 'ẫu',
  'ậuj': 'âuj',

  // âuz
  'ấuz': 'âu',
  'ầuz': 'âu',
  'ẩuz': 'âu',
  'ẫuz': 'âu',
  'ậuz': 'âu',

  //= AO
  // ao

  // ao -> ao + dấu (ở a)
  'aos': 'áo',
  'aof': 'ào',
  'aor': 'ảo',
  'aox': 'ão',
  'aoj': 'ạo',

  // áo
  'áos': 'aos',
  'áof': 'ào',
  'áor': 'ảo',
  'áox': 'ão',
  'áoj': 'ạo',

  // ào
  'àos': 'áo',
  'àof': 'aof',
  'àor': 'ảo',
  'àox': 'ão',
  'àoj': 'ạo',

  // ảo
  'ảos': 'áo',
  'ảof': 'ào',
  'ảor': 'aor',
  'ảox': 'ão',
  'ảoj': 'ạo',

  // ão
  'ãos': 'áo',
  'ãof': 'ào',
  'ãor': 'aox',
  'ãox': 'ão',
  'ãoj': 'ạo',

  // ạo
  'ạos': 'áo',
  'ạof': 'ào',
  'ạor': 'ảo',
  'ạox': 'ão',
  'ạoj': 'aoj',

  // aoz
  'áoz': 'ao',
  'àoz': 'ao',
  'ảoz': 'ao',
  'ãoz': 'ao',
  'ạoz': 'ao',

  //= IA
  // ia

  // ia -> ia + dấu (ở i)
  'ias': 'ía',
  'iaf': 'ìa',
  'iar': 'ỉa',
  'iax': 'ĩa',
  'iaj': 'ịa',

  // ía
  'ías': 'ias',
  'íaf': 'ìa',
  'íar': 'ỉa',
  'íax': 'ĩa',
  'íaj': 'ịa',

  // ìa
  'ìas': 'ía',
  'ìaf': 'iaf',
  'ìar': 'ỉa',
  'ìax': 'ĩa',
  'ìaj': 'ịa',

  // ỉa
  'ỉas': 'ía',
  'ỉaf': 'ìa',
  'ỉar': 'iar',
  'ỉax': 'ĩa',
  'ỉaj': 'ịa',

  // ĩa
  'ĩas': 'ía',
  'ĩaf': 'ìa',
  'ĩar': 'ỉa',
  'ĩax': 'iax',
  'ĩaj': 'ịa',

  // ịa
  'ịas': 'ía',
  'ịaf': 'ìa',
  'ịar': 'ỉa',
  'ịax': 'ĩa',
  'ịaj': 'iaj',

  // iaz
  'íaz': 'ia',
  'ìaz': 'ia',
  'ỉaz': 'ia',
  'ĩaz': 'ia',
  'ịaz': 'ia',

  //= IU
  // iu

  // iu -> iu + dấu (ở i)
  //
  'ius': 'íu',
  'iuf': 'ìu',
  'iur': 'ỉu',
  'iux': 'ĩu',
  'iuj': 'ịu',

  // íu
  'íus': 'ius',
  'íuf': 'ìu',
  'íur': 'ỉu',
  'íux': 'ĩu',
  'íuj': 'ịu',

  // ìu
  'ìus': 'íu',
  'ìuf': 'iuf',
  'ìur': 'ỉu',
  'ìux': 'ĩu',
  'ìuj': 'ịu',

  // ỉu
  'ỉus': 'íu',
  'ỉuf': 'ìu',
  'ỉur': 'iur',
  'ỉux': 'ĩu',
  'ỉuj': 'ịu',

  // ĩu
  'ĩus': 'íu',
  'ĩuf': 'ìu',
  'ĩur': 'ỉu',
  'ĩux': 'iux',
  'ĩuj': 'ịu',

  // ịu
  'ịus': 'íu',
  'ịuf': 'ìu',
  'ịur': 'ỉu',
  'ịux': 'ĩu',
  'ịuj': 'iuj',

  // iuz
  'íuz': 'iu',
  'ìuz': 'iu',
  'ỉuz': 'iu',
  'ĩuz': 'iu',
  'ịuz': 'iu',

  //= IE
  // ie, iê
  'iee': 'iê',
  'iêe': 'iee',

  // ie -> ie + dấu (ở i)
  'ies': 'íe',
  'ief': 'ìe',
  'ier': 'ỉe',
  'iex': 'ĩe',
  'iej': 'ịe',
  // iê + dấu -> ie + dấu (ở i) + e
  'iếe': 'íee',
  'iềe': 'ìee',
  'iểe': 'ỉee',
  'iễe': 'ĩee',
  'iệe': 'ịee',

  // íe
  'íes': 'ies',
  'íef': 'ìe',
  'íer': 'ỉe',
  'íex': 'ĩe',
  'íej': 'ịe',

  // ìe
  'ìes': 'íe',
  'ìef': 'ief',
  'ìer': 'ỉe',
  'ìex': 'ĩe',
  'ìej': 'ịe',

  // ỉe
  'ỉes': 'íe',
  'ỉef': 'ìe',
  'ỉer': 'ier',
  'ỉex': 'ĩe',
  'ỉej': 'ịe',

  // ĩe
  'ĩes': 'íe',
  'ĩef': 'ìe',
  'ĩer': 'ỉe',
  'ĩex': 'iex',
  'ĩej': 'ịe',

  // ịe
  'ịes': 'íe',
  'ịef': 'ìe',
  'ịer': 'ỉe',
  'ịex': 'ĩe',
  'ịej': 'iej',

  // iez
  'íez': 'ie',
  'ìez': 'ie',
  'ỉez': 'ie',
  'ĩez': 'ie',
  'ịez': 'ie',

  // iê -> iê + dấu
  'iês': 'iế',
  'iêf': 'iề',
  'iêr': 'iể',
  'iêx': 'iễ',
  'iêj': 'iệ',
  // ie + dấu -> iê + dấu
  'íee': 'iế',
  'ìee': 'iề',
  'ỉee': 'iể',
  'ĩee': 'iễ',
  'ịee': 'iệ',

  // iế
  'iếs': 'iês',
  'iếf': 'iề',
  'iếr': 'iể',
  'iếx': 'iễ',
  'iếj': 'iệ',

  // iề
  'iềs': 'iế',
  'iềf': 'iêf',
  'iềr': 'iể',
  'iềx': 'iễ',
  'iềj': 'iệ',

  // iể
  'iểs': 'iế',
  'iểf': 'iề',
  'iểr': 'iêr',
  'iểx': 'iễ',
  'iểj': 'iệ',

  // iễ
  'iễs': 'iế',
  'iễf': 'iề',
  'iễr': 'iể',
  'iễx': 'iêx',
  'iễj': 'iệ',

  // iệ
  'iệs': 'iế',
  'iệf': 'iề',
  'iệr': 'iể',
  'iệx': 'iễ',
  'iệj': 'iêj',

  // iêz
  'iếz': 'iê',
  'iềz': 'iê',
  'iểz': 'iê',
  'iễz': 'iê',
  'iệz': 'iê',

  //= YE
  // ye, yê
  'yee': 'yê',
  'yêe': 'yee',

  // ye -> ye + dấu (ở y)
  'yes': 'ýe',
  'yef': 'ỳe',
  'yer': 'ỷe',
  'yex': 'ỹe',
  'yej': 'ỵe',
  // yê + dấu -> ye + dấu (ở y) + e
  'yếe': 'ýee',
  'yềe': 'ỳee',
  'yểe': 'ỷee',
  'yễe': 'ỹee',
  'yệe': 'ỵee',

  // ýe
  'ýes': 'yes',
  'ýef': 'ỳe',
  'ýer': 'ỷe',
  'ýex': 'ỹe',
  'ýej': 'ỵe',

  // ỳe
  'ỳes': 'yé',
  'ỳef': 'yef',
  'ỳer': 'ỷe',
  'ỳex': 'ỹe',
  'ỳej': 'ỵe',

  // ỷe
  'ỷes': 'ýe',
  'ỷef': 'ỳe',
  'ỷer': 'yer',
  'ỷex': 'ỹe',
  'ỷej': 'ỵe',

  // ỹe
  'ỹes': 'ýe',
  'ỹef': 'ỳe',
  'ỹer': 'ỷe',
  'ỹex': 'yex',
  'ỹej': 'ỵe',

  // ỵe
  'ỵes': 'ýe',
  'ỵef': 'ỳe',
  'ỵer': 'ỷe',
  'ỵex': 'ỹe',
  'ỵej': 'yej',

  // yez
  'ýez': 'ye',
  'ỳez': 'ye',
  'ỷez': 'ye',
  'ỹez': 'ye',
  'ỵez': 'ye',

  // yê -> yê + dấu
  'yês': 'yế',
  'yêf': 'yề',
  'yêr': 'yể',
  'yêx': 'yễ',
  'yêj': 'yệ',
  // ye + dấu -> yê + dấu
  'ýee': 'yế',
  'ỳee': 'yề',
  'ỷee': 'yể',
  'ỹee': 'yễ',
  'ỵee': 'yệ',

  // yế
  'yếs': 'yês',
  'yếf': 'yề',
  'yếr': 'yể',
  'yếx': 'yễ',
  'yếj': 'yệ',

  // yề
  'yềs': 'yế',
  'yềf': 'yêf',
  'yềr': 'yể',
  'yềx': 'yễ',
  'yềj': 'yệ',

  // yể
  'yểs': 'yế',
  'yểf': 'yề',
  'yểr': 'yêr',
  'yểx': 'yễ',
  'yểj': 'yệ',

  // yễ
  'yễs': 'yế',
  'yễf': 'yề',
  'yễr': 'yể',
  'yễx': 'yêx',
  'yễj': 'yệ',

  // yệ
  'yệs': 'yế',
  'yệf': 'yề',
  'yệr': 'yể',
  'yệx': 'yễ',
  'yệj': 'yêj',

  // yếz
  'yếz': 'yê',
  'yềz': 'yê',
  'yểz': 'yê',
  'yễz': 'yê',
  'yệz': 'yê',

  //= UA
  // ua, uâ, ưa
  'uaa': 'uâ',
  'uâa': 'uaa',
  'uaư': 'ưa',
  'ưaư': 'uaw',

  // ua -> ua + dấu (ở u)
  'uas': 'úa',
  'uaf': 'ùa',
  'uar': 'ủa',
  'uax': 'ũa',
  'uaj': 'ụa',
  // uâ + dấu -> ua + dấu (ở u) + a
  'uấa': 'úaa',
  'uầa': 'ùaa',
  'uẩa': 'ủaa',
  'uẫa': 'ũaa',
  'uậa': 'ụaa',
  // ưa + dấu -> ua + dấu (ở u) + w
  'ứaư': 'úaw',
  'ừaư': 'ùaw',
  'ửaư': 'ủaw',
  'ữaư': 'ũaw',
  'ựaư': 'ụaw',

  // úa
  'úas': 'uas',
  'úaf': 'ùa',
  'úar': 'ủa',
  'úax': 'ũa',
  'úaj': 'ụa',

  // ùa
  'ùas': 'úa',
  'ùaf': 'uaf',
  'ùar': 'ủa',
  'ùax': 'ũa',
  'ùaj': 'ụa',

  // ủa
  'ủas': 'úa',
  'ủaf': 'ùa',
  'ủar': 'uar',
  'ủax': 'ũa',
  'ủaj': 'ụa',

  // ũa
  'ũas': 'úa',
  'ũaf': 'ùa',
  'ũar': 'ủa',
  'ũax': 'uax',
  'ũaj': 'ụa',

  // ụa
  'ụas': 'úa',
  'ụaf': 'ùa',
  'ụar': 'ủa',
  'ụax': 'ũa',
  'ụaj': 'uaj',

  // uaz
  'úaz': 'ua',
  'ùaz': 'ua',
  'ủaz': 'ua',
  'ũaz': 'ua',
  'ụaz': 'ua',

  // uâ -> uâ + dấu
  'uâs': 'uấ',
  'uâf': 'uầ',
  'uâr': 'uẩ',
  'uâx': 'uẫ',
  'uâj': 'uậ',
  // ua + dấu (ở u) -> uâ + dấu
  'úaa': 'uấ',
  'ùaa': 'uầ',
  'ủaa': 'uẩ',
  'ũaa': 'uẫ',
  'ụaa': 'uậ',
  // ứa + dấu -> uâ + dấu (không có)

  // uấ
  'uấs': 'uâs',
  'uấf': 'uầ',
  'uấr': 'uẩ',
  'uấx': 'uẫ',
  'uấj': 'uậ',

  // uầ
  'uầs': 'uấ',
  'uầf': 'uâf',
  'uầr': 'uẩ',
  'uầx': 'uẫ',
  'uầj': 'uậ',

  // uẩ
  'uẩs': 'uấ',
  'uẩf': 'uầ',
  'uẩr': 'uâr',
  'uẩx': 'uẫ',
  'uẩj': 'uậ',

  // uẫ
  'uẫs': 'uấ',
  'uẫf': 'uầ',
  'uẫr': 'uẩ',
  'uẫx': 'uâx',
  'uẫj': 'uậ',

  // uậ
  'uậs': 'uấ',
  'uậf': 'uầ',
  'uậr': 'uẩ',
  'uậx': 'uẫ',
  'uậj': 'uâj',

  // uâz
  'uấz': 'uâ',
  'uầz': 'uâ',
  'uẩz': 'uâ',
  'uẫz': 'uâ',
  'uậz': 'uâ',

  // ưa -> ưa + dấu
  'ưas': 'ứa',
  'ưaf': 'ừa',
  'ưar': 'ửa',
  'ưax': 'ữa',
  'ưaj': 'ựa',
  // ua + dấu (ở u) -> ưa + dấu
  'úaư': 'ứa',
  'ùaư': 'ừa',
  'ủaư': 'ửa',
  'ũaư': 'ữa',
  'ụaư': 'ựa',
  // uâ + dấu -> ưa + dấu (không có)

  // ứa
  'ứas': 'ưas',
  'ứaf': 'ừa',
  'ứar': 'ửa',
  'ứax': 'ữa',
  'ứaj': 'ựa',

  // ừa
  'ừas': 'ứa',
  'ừaf': 'ưaf',
  'ừar': 'ửa',
  'ừax': 'ữa',
  'ừaj': 'ựa',

  // ửa
  'ửas': 'ứa',
  'ửaf': 'ừa',
  'ửar': 'ưar',
  'ửax': 'ữa',
  'ửaj': 'ựa',

  // ữa
  'ữas': 'ứa',
  'ữaf': 'ừa',
  'ữar': 'ửa',
  'ữax': 'ưax',
  'ữaj': 'ựa',

  // ựa
  'ựas': 'ứa',
  'ựaf': 'ừa',
  'ựar': 'ửa',
  'ựax': 'ữa',
  'ựaj': 'ưaj',

  // ưaz
  'ứaz': 'ưa',
  'ừaz': 'ưa',
  'ửaz': 'ưa',
  'ữaz': 'ưa',
  'ựaz': 'ưa',

  //= UI
  // ui, ưi
  'uiư': 'ưi',
  'ưiư': 'uiw',

  // ui -> ui + dấu (ở u)
  'uis': 'úi',
  'uif': 'ùi',
  'uir': 'ủi',
  'uix': 'ũi',
  'uij': 'ụi',
  // ưi + dấu -> ui + dấu (ở u) + w
  'ứiư': 'úiw',
  'ừiư': 'ùiw',
  'ửiư': 'ủiw',
  'ữiư': 'ũiw',
  'ựiư': 'ụiw',

  // úi
  'úis': 'uis',
  'úif': 'ùi',
  'úir': 'ủi',
  'úix': 'ũi',
  'úij': 'ụi',

  // ùi
  'ùis': 'úi',
  'ùif': 'uif',
  'ùir': 'ủi',
  'ùix': 'ũi',
  'ùij': 'ụi',

  // ủi
  'ủis': 'úi',
  'ủif': 'ùi',
  'ủir': 'uir',
  'ủix': 'ũi',
  'ủij': 'ụi',

  // ũi
  'ũis': 'úi',
  'ũif': 'ùi',
  'ũir': 'ủi',
  'ũix': 'uix',
  'ũij': 'ụi',

  // ụi
  'ụis': 'úi',
  'ụif': 'ùi',
  'ụir': 'ủi',
  'ụix': 'ũi',
  'ụij': 'uij',

  // uiz
  'úiz': 'ui',
  'ùiz': 'ui',
  'ủiz': 'ui',
  'ũiz': 'ui',
  'ụiz': 'ui',

  // ưi -> ưi + dấu
  'ưis': 'ứi',
  'ưif': 'ừi',
  'ưir': 'ửi',
  'ưix': 'ữi',
  'ưij': 'ựi',
  // ui + dấu (ở u) -> ưi + dấu
  'úiư': 'ứi',
  'ùiư': 'ừi',
  'ủiư': 'ửi',
  'ũiư': 'ữi',
  'ụiư': 'ựi',

  // ứi
  'ứis': 'ưis',
  'ứif': 'ừi',
  'ứir': 'ửi',
  'ứix': 'ữi',
  'ứij': 'ựi',

  // ừi
  'ừis': 'ứi',
  'ừif': 'ưif',
  'ừir': 'ửi',
  'ừix': 'ữi',
  'ừij': 'ựi',

  // ửi
  'ửis': 'ứi',
  'ửif': 'ừi',
  'ửir': 'ưir',
  'ửix': 'ữi',
  'ửij': 'ựi',

  // ữi
  'ữis': 'ứi',
  'ữif': 'ừi',
  'ữir': 'ửi',
  'ữix': 'ưix',
  'ữij': 'ựi',

  // ựi
  'ựis': 'ứi',
  'ựif': 'ừi',
  'ựir': 'ửi',
  'ựix': 'ữi',
  'ựij': 'ưij',

  // ưiz
  'ứiz': 'ưi',
  'ừiz': 'ưi',
  'ửiz': 'ưi',
  'ữiz': 'ưi',
  'ựiz': 'ưi',

  //= UY
  // uy

  // uy -> uy + dấu (ở u)
  'uys': 'úy',
  'uyf': 'ùy',
  'uyr': 'ủy',
  'uyx': 'ũy',
  'uyj': 'ụy',

  // úy
  'úys': 'uys',
  'úyf': 'ùy',
  'úyr': 'ủy',
  'úyx': 'ũy',
  'úyj': 'ụy',

  // ùy
  'ùys': 'úy',
  'ùyf': 'uyf',
  'ùyr': 'ủy',
  'ùyx': 'ũy',
  'ùyj': 'ụy',

  // ủy
  'ủys': 'úy',
  'ủyf': 'ùy',
  'ủyr': 'uyr',
  'ủyx': 'ũy',
  'ủyj': 'ụy',

  // ũy
  'ũys': 'úy',
  'ũyf': 'ùy',
  'ũyr': 'ủy',
  'ũyx': 'uyx',
  'ũyj': 'ụy',

  // ụy
  'ụys': 'úy',
  'ụyf': 'ùy',
  'ụyr': 'ủy',
  'ụyx': 'ũy',
  'ụyj': 'uyj',

  // uyz
  'úyz': 'uy',
  'ùyz': 'uy',
  'ủyz': 'uy',
  'ũyz': 'uy',
  'ụyz': 'uy',

  //= UU
  // uu, ưu
  'uuư': 'ưu',
  'ưuư': 'uuw',

  // uu -> uu + dấu (ở trước)
  'uus': 'úu',
  'uuf': 'ùu',
  'uur': 'ủu',
  'uux': 'ũu',
  'uuj': 'ụu',
  // ưu + dấu -> uu + dấu (ở trước) + w
  'ứuư': 'úuw',
  'ừuư': 'ùuw',
  'ửuư': 'ủuw',
  'ữuư': 'ũuw',
  'ựuư': 'ụuw',

  // úu
  'úus': 'uus',
  'úuf': 'ùu',
  'úur': 'ủu',
  'úux': 'ũu',
  'úuj': 'ụu',

  // ùu
  'ùus': 'úu',
  'ùuf': 'uuf',
  'ùur': 'ủu',
  'ùux': 'ũu',
  'ùuj': 'ụu',

  // ủu
  'ủus': 'úu',
  'ủuf': 'ùu',
  'ủur': 'uur',
  'ủux': 'ũu',
  'ủuj': 'ụu',

  // ũu
  'ũus': 'úu',
  'ũuf': 'ùu',
  'ũur': 'ủu',
  'ũux': 'uux',
  'ũuj': 'ụu',

  // ụu
  'ụus': 'úu',
  'ụuf': 'ùu',
  'ụur': 'ủu',
  'ụux': 'ũu',
  'ụuj': 'uuj',

  // uuz
  'úu': 'uu',
  'ùu': 'uu',
  'ủu': 'uu',
  'ũu': 'uu',
  'ụu': 'uu',

  // ưu -> ưu + dấu
  'ưus': 'ứu',
  'ưuf': 'ừu',
  'ưur': 'ửu',
  'ưux': 'ữu',
  'ưuj': 'ựu',
  // uu + dấu (ở trước) -> ưu + dấu
  'úuư': 'ứu',
  'ùuư': 'ừu',
  'ủuư': 'ửu',
  'ũuư': 'ữu',
  'ụuư': 'ựu',

  // ứu
  'ứus': 'ưus',
  'ứuf': 'ừu',
  'ứur': 'ửu',
  'ứux': 'ữu',
  'ứuj': 'ựu',

  // ừu
  'ừus': 'ứu',
  'ừuf': 'ưuf',
  'ừur': 'ửu',
  'ừux': 'ữu',
  'ừuj': 'ựu',

  // ửu
  'ửus': 'ứu',
  'ửuf': 'ừu',
  'ửur': 'ưur',
  'ửux': 'ữu',
  'ửuj': 'ựu',

  // ữu
  'ữus': 'ứu',
  'ữuf': 'ừu',
  'ữur': 'ửu',
  'ữux': 'ưux',
  'ữuj': 'ựu',

  // ựu
  'ựus': 'ứu',
  'ựuf': 'ừu',
  'ựur': 'ửu',
  'ựux': 'ữu',
  'ựuj': 'ưuj',

  // ưuz
  'ứuz': 'ưu',
  'ừuz': 'ưu',
  'ửuz': 'ưu',
  'ữuz': 'ưu',
  'ựuz': 'ưu',

  //= UE
  // ue, uê
  'uee': 'uê',
  'uêe': 'uee',

  // ue -> ue + dấu (ở u)
  'ues': 'úe',
  'uef': 'ùe',
  'uer': 'ủe',
  'uex': 'ũe',
  'uej': 'ụe',
  // uê + dấu -> ue + dấu (ở u) + e
  'uếe': 'úee',
  'uềe': 'ùee',
  'uểe': 'ủee',
  'uễe': 'ũee',
  'uệe': 'ụee',

  // úe
  'úes': 'ues',
  'úef': 'ùe',
  'úer': 'ủe',
  'úex': 'ũe',
  'úej': 'ụe',

  // ùe
  'ùes': 'úe',
  'ùef': 'uef',
  'ùer': 'ủe',
  'ùex': 'ũe',
  'ùej': 'ụe',

  // ủe
  'ủes': 'úe',
  'ủef': 'ùe',
  'ủer': 'uer',
  'ủex': 'ũe',
  'ủej': 'ụe',

  // ũe
  'ũes': 'úe',
  'ũef': 'ùe',
  'ũer': 'ủe',
  'ũex': 'uex',
  'ũej': 'ụe',

  // ụe
  'ụes': 'úe',
  'ụef': 'ùe',
  'ụer': 'ủe',
  'ụex': 'ũe',
  'ụej': 'uej',

  // uez
  'úez': 'ue',
  'ùez': 'ue',
  'ủez': 'ue',
  'ũez': 'ue',
  'ụez': 'ue',

  // uê -> uê + dấu
  'uês': 'uế',
  'uêf': 'uề',
  'uêr': 'uể',
  'uêx': 'uễ',
  'uêj': 'uệ',
  // ue + dấu (ở u) -> uê + dấu
  'úee': 'uế',
  'ùee': 'uề',
  'ủee': 'uể',
  'ũee': 'uễ',
  'ụee': 'uệ',

  // uế
  'uếs': 'uês',
  'uếf': 'uề',
  'uếr': 'uể',
  'uếx': 'uễ',
  'uếj': 'uệ',

  // uề
  'uềs': 'uế',
  'uềf': 'uêf',
  'uềr': 'uể',
  'uềx': 'uễ',
  'uềj': 'uệ',

  // uể
  'uểs': 'uế',
  'uểf': 'uề',
  'uểr': 'uêr',
  'uểx': 'uễ',
  'uểj': 'uệ',

  // uễ
  'uễs': 'uế',
  'uễf': 'uề',
  'uễr': 'uể',
  'uễx': 'uêx',
  'uễj': 'uệ',

  // uệ
  'uệs': 'uế',
  'uệf': 'uề',
  'uệr': 'uể',
  'uệx': 'uễ',
  'uệj': 'uêj',

  // uêz
  'uếz': 'uê',
  'uềz': 'uê',
  'uểz': 'uê',
  'uễz': 'uê',
  'uệz': 'uê',

  //= UO
  // uo, uô, ươ, ưo (uwo)
  'uoo': 'uô',
  'ươo': 'uô',
  'ưoo': 'uô',
  'uôo': 'uoo',
  'uoư': 'ươ',
  'ưoư': 'ươ',
  'uôư': 'ươ',
  'ươư': 'uow',

  // uo -> uo + dấu (ở u)
  'uos': 'úo',
  'uof': 'ùo',
  'uor': 'ủo',
  'uox': 'ũo',
  'uoj': 'ụo',
  // uô + dấu -> uo + dấu (ở u) + o
  'uốo': 'úoo',
  'uồo': 'ùoo',
  'uổo': 'ủoo',
  'uỗo': 'ũoo',
  'uộo': 'ụoo',
  // ươ + dấu -> uo + dấu (ở u) + w
  'ướư': 'úow',
  'ườư': 'ùow',
  'ưởư': 'ủow',
  'ưỡư': 'ũow',
  'ượư': 'ụow',

  // úo
  'úos': 'uos',
  'úof': 'ùo',
  'úor': 'ủo',
  'úox': 'ũo',
  'úoj': 'ụo',

  // ùo
  'ùos': 'úo',
  'ùof': 'uof',
  'ùor': 'ủo',
  'ùox': 'ũo',
  'ùoj': 'ụo',

  // ủo
  'ủos': 'úo',
  'ủof': 'ùo',
  'ủor': 'uor',
  'ủox': 'ũo',
  'ủoj': 'ụo',

  // ũo
  'ũos': 'úo',
  'ũof': 'ùo',
  'ũor': 'ủo',
  'ũox': 'uox',
  'ũoj': 'ụo',

  // ụo
  'ụos': 'úo',
  'ụof': 'ùo',
  'ụor': 'ủo',
  'ụox': 'ũo',
  'ụoj': 'uoj',

  // uoz
  'úoz': 'uo',
  'ùoz': 'uo',
  'ủoz': 'uo',
  'ũoz': 'uo',
  'ụoz': 'uo',

  // uô -> uô + dấu
  'uôs': 'uố',
  'uôf': 'uồ',
  'uôr': 'uổ',
  'uôx': 'uỗ',
  'uôj': 'uộ',
  // uo + dấu (ở u) -> uô + dấu
  'úoo': 'uố',
  'ùoo': 'uồ',
  'ủoo': 'uổ',
  'ũoo': 'uỗ',
  'ụoo': 'uộ',
  // ươ + dấu -> uô + dấu
  'ướo': 'uố',
  'ườo': 'uồ',
  'ưởo': 'uổ',
  'ưỡo': 'uỗ',
  'ượo': 'uộ',
  // ưo + dấu -> uô + dấu
  'ứoo': 'uố',
  'ừoo': 'uồ',
  'ửoo': 'uổ',
  'ữoo': 'uỗ',
  'ựoo': 'uộ',

  // uố
  'uốs': 'uôs',
  'uốf': 'uồ',
  'uốr': 'uổ',
  'uốx': 'uỗ',
  'uốj': 'uộ',

  // uồ
  'uồs': 'uố',
  'uồf': 'uôf',
  'uồr': 'uổ',
  'uồx': 'uỗ',
  'uồj': 'uộ',

  // uổ
  'uổs': 'uố',
  'uổf': 'uồ',
  'uổr': 'uôr',
  'uổx': 'uỗ',
  'uổj': 'uộ',

  // uỗ
  'uỗs': 'uố',
  'uỗf': 'uồ',
  'uỗr': 'uổ',
  'uỗx': 'uôx',
  'uỗj': 'uộ',

  // uộ
  'uộs': 'uố',
  'uộf': 'uồ',
  'uộr': 'uổ',
  'uộx': 'uỗ',
  'uộj': 'uôj',

  // uôz
  'uốz': 'uô',
  'uồz': 'uô',
  'uổz': 'uô',
  'uỗz': 'uô',
  'uộz': 'uô',

  // ươ -> ươ + dấu
  'ươs': 'ướ',
  'ươf': 'ườ',
  'ươr': 'ưở',
  'ươx': 'ưỡ',
  'ươj': 'ượ',
  // uo + dấu (ở u) -> ươ + dấu
  'úoư': 'ướ',
  'ùoư': 'ườ',
  'ủoư': 'ưở',
  'ũoư': 'ưỡ',
  'ụoư': 'ượ',
  // uô + dấu -> ươ + dấu
  'uốư': 'ướ',
  'uồư': 'ườ',
  'uổư': 'ưở',
  'uỗư': 'ưỡ',
  'uộư': 'ượ',
  // ưo + dấu -> ươ + dấu
  'ứoư': 'ướ',
  'ừoư': 'ườ',
  'ửoư': 'ưở',
  'ữoư': 'ưỡ',
  'ựoư': 'ượ',

  // ướ
  'ướs': 'ươs',
  'ướf': 'ườ',
  'ướr': 'ưở',
  'ướx': 'ưỡ',
  'ướj': 'ượ',

  // ườ
  'ườs': 'ướ',
  'ườf': 'ươf',
  'ườr': 'ưở',
  'ườx': 'ưỡ',
  'ườj': 'ượ',

  // ưở
  'ưởs': 'ướ',
  'ưởf': 'ườ',
  'ưởr': 'ươr',
  'ưởx': 'ưỡ',
  'ưởj': 'ượ',

  // ưỡ
  'ưỡs': 'ướ',
  'ưỡf': 'ườ',
  'ưỡr': 'ưở',
  'ưỡx': 'ươx',
  'ưỡj': 'ượ',

  // ượ
  'ượs': 'ướ',
  'ượf': 'ườ',
  'ượr': 'ưở',
  'ượx': 'ưỡ',
  'ượj': 'ươj',

  // ươz
  'ướz': 'ươ',
  'ườz': 'ươ',
  'ưởz': 'ươ',
  'ưỡz': 'ươ',
  'ượz': 'ươ',

  // ưo -> ưo + dấu
  'ưos': 'ứo',
  'ưof': 'ừo',
  'ưor': 'ửo',
  'ưox': 'ữo',
  'ưoj': 'ựo',

  // ứo
  'ứos': 'ưos',
  'ứof': 'ừo',
  'ứor': 'ửo',
  'ứox': 'ữo',
  'ứoj': 'ựo',

  // ừo
  'ừos': 'ứo',
  'ừof': 'ưof',
  'ừor': 'ửo',
  'ừox': 'ữo',
  'ừoj': 'ựo',

  // ửo
  'ửos': 'ứo',
  'ửof': 'ừo',
  'ửor': 'ưor',
  'ửox': 'ữo',
  'ửoj': 'ựo',

  // ữo
  'ữos': 'ứo',
  'ữof': 'ừo',
  'ữor': 'ửo',
  'ữox': 'ưox',
  'ữoj': 'ựo',

  // ựo
  'ựos': 'ứo',
  'ựof': 'ừo',
  'ựor': 'ửo',
  'ựox': 'ữo',
  'ựoj': 'ưoj',

  // ưoz (has a special one - the last one)
  'ứoz': 'ưo',
  'ừoz': 'ưo',
  'ửoz': 'ưo',
  'ữoz': 'ưo',
  'ựoz': 'ưo',
  'ưoz': 'ươz',

  //= EO
  // eo

  // eo -> eo + dấu (ở e)
  'eos': 'éo',
  'eof': 'èo',
  'eor': 'ẻo',
  'eox': 'ẽo',
  'eoj': 'ẹo',

  // éo
  'éos': 'eos',
  'éof': 'èo',
  'éor': 'ẻo',
  'éox': 'ẽo',
  'éoj': 'ẹo',

  // èo
  'èos': 'éo',
  'èof': 'eof',
  'èor': 'ẻo',
  'èox': 'ẽo',
  'èoj': 'ẹo',

  // ẻo
  'ẻos': 'éo',
  'ẻof': 'èo',
  'ẻor': 'eor',
  'ẻox': 'ẽo',
  'ẻoj': 'ẹo',

  // ẽo
  'ẽos': 'éo',
  'ẽof': 'èo',
  'ẽor': 'ẻo',
  'ẽox': 'eox',
  'ẽoj': 'ẹo',

  // ẹo
  'ẹos': 'éo',
  'ẹof': 'èo',
  'ẹor': 'ẻo',
  'ẹox': 'ẽo',
  'ẹoj': 'eoj',

  // eoz
  'éoz': 'eo',
  'èoz': 'eo',
  'ẻoz': 'eo',
  'ẽoz': 'eo',
  'ẹoz': 'eo',

  //= EU
  // eu, êu
  'eue': 'êu',
  'êue': 'eue',

  // eu -> eu + dấu (ở e)
  'eus': 'éu',
  'euf': 'èu',
  'eur': 'ẻu',
  'eux': 'ẽu',
  'euj': 'ẹu',
  // êu + dấu -> eu + dấu (ở e) + e
  'ếue': 'éue',
  'ềue': 'èue',
  'ểue': 'ẻue',
  'ễue': 'ẽue',
  'ệue': 'ẹue',

  // éu
  'éus': 'eus',
  'éuf': 'èu',
  'éur': 'ẻu',
  'éux': 'ẽu',
  'éuj': 'ẹu',

  // èu
  'èus': 'éu',
  'èuf': 'euf',
  'èur': 'ẻu',
  'èux': 'ẽu',
  'èuj': 'ẹu',

  // ẻu
  'ẻus': 'éu',
  'ẻuf': 'èu',
  'ẻur': 'eur',
  'ẻux': 'ẽu',
  'ẻuj': 'ẹu',

  // ẽu
  'ẽus': 'éu',
  'ẽuf': 'èu',
  'ẽur': 'ẻu',
  'ẽux': 'eux',
  'ẽuj': 'ẹu',

  // ẹu
  'ẹus': 'éu',
  'ẹuf': 'èu',
  'ẹur': 'ẻu',
  'ẹux': 'ẽu',
  'ẹuj': 'euj',

  // euz
  'éuz': 'eu',
  'èuz': 'eu',
  'ẻuz': 'eu',
  'ẽuz': 'eu',
  'ẹuz': 'eu',

  // êu -> êu + dấu
  'êus': 'ếu',
  'êuf': 'ều',
  'êur': 'ểu',
  'êux': 'ễu',
  'êuj': 'ệu',
  // eu + dấu (ở e) -> êu + dấu
  'éue': 'ếu',
  'èue': 'ều',
  'ẻue': 'ểu',
  'ẽue': 'ễu',
  'ẹue': 'ệu',

  // ếu
  'ếus': 'êus',
  'ếuf': 'ều',
  'ếur': 'ểu',
  'ếux': 'ễu',
  'ếuj': 'ệu',

  // ều
  'ềus': 'ếu',
  'ềuf': 'êuf',
  'ềur': 'ểu',
  'ềux': 'ễu',
  'ềuj': 'ệu',

  // ểu
  'ểus': 'ếu',
  'ểuf': 'ều',
  'ểur': 'êur',
  'ểux': 'ễu',
  'ểuj': 'ệu',

  // ễu
  'ễus': 'ếu',
  'ễuf': 'ều',
  'ễur': 'ểu',
  'ễux': 'êux',
  'ễuj': 'ệu',

  // ệu
  'ệus': 'ếu',
  'ệuf': 'ều',
  'ệur': 'ểu',
  'ệux': 'ễu',
  'ệuj': 'êuj',

  // êuz
  'ếuz': 'êu',
  'ềuz': 'êu',
  'ểuz': 'êu',
  'ễuz': 'êu',
  'ệuz': 'êu',

  //= OA
  // oa, oă
  'oaư': 'oă',
  'oăư': 'oaw',

  // oa -> oa + dấu (ở o)
  'oas': 'óa',
  'oaf': 'òa',
  'oar': 'ỏa',
  'oax': 'õa',
  'oaj': 'ọa',
  // oă + dấu -> oa + dấu (ở o) + w
  'oắư': 'óaw',
  'oằư': 'òaw',
  'oẳư': 'ỏaw',
  'oẵư': 'õaw',
  'oặư': 'ọaw',

  // óa
  'óas': 'oas',
  'óaf': 'òa',
  'óar': 'ỏa',
  'óax': 'õa',
  'óaj': 'ọa',

  // òa
  'òas': 'óa',
  'òaf': 'oaf',
  'òar': 'ỏa',
  'òax': 'õa',
  'òaj': 'ọa',

  // ỏa
  'ỏas': 'óa',
  'ỏaf': 'òa',
  'ỏar': 'oar',
  'ỏax': 'õa',
  'ỏaj': 'ọa',

  // õa
  'õas': 'óa',
  'õaf': 'òa',
  'õar': 'ỏa',
  'õax': 'oax',
  'õaj': 'ọa',

  // ọa
  'ọas': 'óa',
  'ọaf': 'òa',
  'ọar': 'ỏa',
  'ọax': 'õa',
  'ọaj': 'oaj',

  // oaz
  'óaz': 'oa',
  'òaz': 'oa',
  'ỏaz': 'oa',
  'õaz': 'oa',
  'ọaz': 'oa',

  // oă -> oă + dấu
  'oăs': 'oắ',
  'oăf': 'oằ',
  'oăr': 'oẳ',
  'oăx': 'oẵ',
  'oăj': 'oặ',
  // oa + dấu (ở o) -> oă + dấu
  'óaư': 'oắ',
  'òaư': 'oằ',
  'ỏaư': 'oẳ',
  'õaư': 'oẵ',
  'ọaư': 'oặ',

  // oắ
  'oắs': 'oăs',
  'oắf': 'oằ',
  'oắr': 'oẳ',
  'oắx': 'oẵ',
  'oắj': 'oặ',

  // oằ
  'oằs': 'oắ',
  'oằf': 'oăf',
  'oằr': 'oẳ',
  'oằx': 'oẵ',
  'oằj': 'oặ',

  // oẳ
  'oẳs': 'oắ',
  'oẳf': 'oằ',
  'oẳr': 'oăr',
  'oẳx': 'oẵ',
  'oẳj': 'oặ',

  // oẵ
  'oẵs': 'oắ',
  'oẵf': 'oằ',
  'oẵr': 'oẳ',
  'oẵx': 'oăx',
  'oẵj': 'oặ',

  // oặ
  'oặs': 'oắ',
  'oặf': 'oằ',
  'oặr': 'oẳ',
  'oặx': 'oẵ',
  'oặj': 'oăj',

  // oăz
  'oắz': 'oă',
  'oằz': 'oă',
  'oẳz': 'oă',
  'oẵz': 'oă',
  'oặz': 'oă',

  //= OE
  // oe

  // oe -> oe + dấu (ở o)
  'oes': 'óe',
  'oef': 'òe',
  'oer': 'ỏe',
  'oex': 'õe',
  'oej': 'ọe',

  // óe
  'óes': 'oes',
  'óef': 'òe',
  'óer': 'ỏe',
  'óex': 'õe',
  'óej': 'ọe',

  // òe
  'òes': 'óe',
  'òef': 'oef',
  'òer': 'ỏe',
  'òex': 'õe',
  'òej': 'ọe',

  // ỏe
  'ỏes': 'óe',
  'ỏef': 'òe',
  'ỏer': 'oer',
  'ỏex': 'õe',
  'ỏej': 'ọe',

  // õe
  'ões': 'óe',
  'õef': 'òe',
  'õer': 'ỏe',
  'õex': 'oex',
  'õej': 'ọe',

  // ọe
  'ọes': 'óe',
  'ọef': 'òe',
  'ọer': 'ỏe',
  'ọex': 'õe',
  'ọej': 'oej',

  // oez
  'óez': 'oez',
  'òez': 'oez',
  'ỏez': 'oez',
  'õez': 'oez',
  'ọez': 'oez',

  //= OI
  // oi, ôi, ơi
  'oio': 'ôi',
  'ơio': 'ôi',
  'ôio': 'oio',
  'oiư': 'ơi',
  'ôiư': 'ơi',
  'ơiư': 'oiw',

  // oi -> oi + dấu (ở o)
  'ois': 'ói',
  'oif': 'òi',
  'oir': 'ỏi',
  'oix': 'õi',
  'oij': 'ọi',
  // ôi + dấu -> oi + dấu (ở o) + o
  'ốio': 'óio',
  'ồio': 'òio',
  'ổio': 'ỏio',
  'ỗio': 'õio',
  'ộio': 'ọio',
  // ơi + dấu -> oi + dấu (ở o) + w
  'ớiư': 'óiw',
  'ờiư': 'òiw',
  'ởiư': 'ỏiw',
  'ỡiư': 'õiw',
  'ợiư': 'ọiw',

  // ói
  'óis': 'ois',
  'óif': 'òi',
  'óir': 'ỏi',
  'óix': 'õi',
  'óij': 'ọi',

  // òi
  'òis': 'ói',
  'òif': 'oif',
  'òir': 'ỏi',
  'òix': 'õi',
  'òij': 'ọi',

  // ỏi
  'ỏis': 'ói',
  'ỏif': 'òi',
  'ỏir': 'oir',
  'ỏix': 'õi',
  'ỏij': 'ọi',

  // õi
  'õis': 'ói',
  'õif': 'òi',
  'õir': 'ỏi',
  'õix': 'oix',
  'õij': 'ọi',

  // ọi
  'ọis': 'ói',
  'ọif': 'òi',
  'ọir': 'ỏi',
  'ọix': 'õi',
  'ọij': 'oij',

  // oiz
  'óiz': 'oiz',
  'òiz': 'oiz',
  'ỏiz': 'oiz',
  'õiz': 'oiz',
  'ọiz': 'oiz',

  // ôi -> ôi + dấu
  'ôis': 'ối',
  'ôif': 'ồi',
  'ôir': 'ổi',
  'ôix': 'ỗi',
  'ôij': 'ội',
  // oi + dấu (ở o) -> ôi + dấu
  'óio': 'ối',
  'òio': 'ồi',
  'ỏio': 'ổi',
  'õio': 'ỗi',
  'ọio': 'ội',
  // ơi + dấu -> ôi + dấu
  'ớio': 'ối',
  'ờio': 'ồi',
  'ởio': 'ổi',
  'ỡio': 'ỗi',
  'ợio': 'ội',

  // ối
  'ốis': 'ôis',
  'ốif': 'ồi',
  'ốir': 'ổi',
  'ốix': 'ỗi',
  'ốij': 'ội',

  // ồi
  'ồis': 'ối',
  'ồif': 'ôif',
  'ồir': 'ổi',
  'ồix': 'ỗi',
  'ồij': 'ội',

  // ổi
  'ổis': 'ối',
  'ổif': 'ồi',
  'ổir': 'ôir',
  'ổix': 'ỗi',
  'ổij': 'ội',

  // ỗi
  'ỗis': 'ối',
  'ỗif': 'ồi',
  'ỗir': 'ổi',
  'ỗix': 'ôix',
  'ỗij': 'ội',

  // ội
  'ộis': 'ối',
  'ộif': 'ồi',
  'ộir': 'ổi',
  'ộix': 'ỗi',
  'ộij': 'ôij',

  // ôiz
  'ốiz': 'ôi',
  'ồiz': 'ôi',
  'ổiz': 'ôi',
  'ỗiz': 'ôi',
  'ộiz': 'ôi',

  // ơi -> ơi + dấu
  'ơis': 'ới',
  'ơif': 'ời',
  'ơir': 'ởi',
  'ơix': 'ỡi',
  'ơij': 'ợi',
  // oi + dấu (ở o) -> ơi + dấu
  'óiư': 'ới',
  'òiư': 'ời',
  'ỏiư': 'ởi',
  'õiư': 'ỡi',
  'ọiư': 'ợi',
  // ôi + dấu -> ơi + dấu
  'ốiư': 'ới',
  'ồiư': 'ời',
  'ổiư': 'ởi',
  'ỗiư': 'ỡi',
  'ộiư': 'ợi',

  // ới
  'ớis': 'ơis',
  'ớif': 'ời',
  'ớir': 'ởi',
  'ớix': 'ỡi',
  'ớij': 'ợi',

  // ời
  'ờis': 'ới',
  'ờif': 'ơif',
  'ờir': 'ởi',
  'ờix': 'ỡi',
  'ờij': 'ợi',

  // ởi
  'ởis': 'ới',
  'ởif': 'ời',
  'ởir': 'ơir',
  'ởix': 'ỡi',
  'ởij': 'ợi',

  // ỡi
  'ỡis': 'ới',
  'ỡif': 'ời',
  'ỡir': 'ởi',
  'ỡix': 'ơix',
  'ỡij': 'ợi',

  // ợi
  'ợis': 'ới',
  'ợif': 'ời',
  'ợir': 'ởi',
  'ợix': 'ỡi',
  'ợij': 'ơij',

  // ơiz
  'ớiz': 'ơi',
  'ờiz': 'ơi',
  'ởiz': 'ơi',
  'ỡiz': 'ơi',
  'ợiz': 'ơi',

  //= IEU
  // ieu, iêu
  'ieue': 'iêu',
  'iêue': 'ieue',

  // ieu -> ieu + dấu (ở e)
  'ieus': 'iéu',
  'ieuf': 'ièu',
  'ieur': 'iẻu',
  'ieux': 'iẽu',
  'ieuj': 'iẹu',
  // iêu + dấu -> ieu + dấu (ở e) + e
  'iếue': 'iéue',
  'iềue': 'ièue',
  'iểue': 'iẻue',
  'iễue': 'iẽue',
  'iệue': 'iẹue',

  // iéu
  'iéus': 'ieus',
  'iéuf': 'ièu',
  'iéur': 'iẻu',
  'iéux': 'iẽu',
  'iéuj': 'iẹu',

  // ièu
  'ièus': 'iéu',
  'ièuf': 'ieuf',
  'ièur': 'iẻu',
  'ièux': 'iẽu',
  'ièuj': 'iẹu',

  // iẻu
  'iẻus': 'iéu',
  'iẻuf': 'ièu',
  'iẻur': 'ieur',
  'iẻux': 'iẽu',
  'iẻuj': 'iẹu',

  // iẽu
  'iẽus': 'iéu',
  'iẽuf': 'ièu',
  'iẽur': 'iẻu',
  'iẽux': 'ieux',
  'iẽuj': 'iẹu',

  // iẹu
  'iẹus': 'iéu',
  'iẹuf': 'ièu',
  'iẹur': 'iẻu',
  'iẹux': 'iẽu',
  'iẹuj': 'ieuj',

  // ieuz
  'iéuz': 'ieu',
  'ièuz': 'ieu',
  'iẻuz': 'ieu',
  'iẽuz': 'ieu',
  'iẹuz': 'ieu',

  // iêu -> iêu + dấu
  'iêus': 'iếu',
  'iêuf': 'iều',
  'iêur': 'iểu',
  'iêux': 'iễu',
  'iêuj': 'iệu',
  // ieu + dấu (ở e) -> iêu + dấu
  'iéue': 'iếu',
  'ièue': 'iều',
  'iẻue': 'iểu',
  'iẽue': 'iễu',
  'iẹue': 'iệu',

  // iếu
  'iếus': 'iêus',
  'iếuf': 'iều',
  'iếur': 'iểu',
  'iếux': 'iễu',
  'iếuj': 'iệu',

  // iều
  'iềus': 'iếu',
  'iềuf': 'iêuf',
  'iềur': 'iểu',
  'iềux': 'iễu',
  'iềuj': 'iệu',

  // iểu
  'iểus': 'iếu',
  'iểuf': 'iều',
  'iểur': 'iêur',
  'iểux': 'iễu',
  'iểuj': 'iệu',

  // iễu
  'iễus': 'iếu',
  'iễuf': 'iều',
  'iễur': 'iểu',
  'iễux': 'iêux',
  'iễuj': 'iệu',

  // iệu
  'iệus': 'iếu',
  'iệuf': 'iều',
  'iệur': 'iểu',
  'iệux': 'iễu',
  'iệuj': 'iêuj',

  // iêuz
  'iếuz': 'iêu',
  'iềuz': 'iêu',
  'iểuz': 'iêu',
  'iễuz': 'iêu',
  'iệuz': 'iêu',

  //= YEU
  // yeu, yêu
  'yeue': 'yêu',
  'yêue': 'yeue',

  // yeu -> yeu + dấu (ở e)
  'yeus': 'yéu',
  'yeuf': 'yèu',
  'yeur': 'yẻu',
  'yeux': 'yẽu',
  'yeuj': 'yẹu',
  // yêu + dấu -> yeu + dấu (ở e) + e
  'yếue': 'yéue',
  'yềue': 'yèue',
  'yểue': 'yẻue',
  'yễue': 'yẽue',
  'yệue': 'yẹue',

  // yéu
  'yéus': 'yeus',
  'yéuf': 'yèu',
  'yéur': 'yẻu',
  'yéux': 'yẽu',
  'yéuj': 'yẹu',

  // yèu
  'yèus': 'yéu',
  'yèuf': 'yeuf',
  'yèur': 'yẻu',
  'yèux': 'yẽu',
  'yèuj': 'yẹu',

  // yẻu
  'yẻus': 'yéu',
  'yẻuf': 'yèu',
  'yẻur': 'yeur',
  'yẻux': 'yẽu',
  'yẻuj': 'yẹu',

  // yẽu
  'yẽus': 'yéu',
  'yẽuf': 'yèu',
  'yẽur': 'yẻu',
  'yẽux': 'yeux',
  'yẽuj': 'yẹu',

  // yẹu
  'yẹus': 'yéu',
  'yẹuf': 'yèu',
  'yẹur': 'yẻu',
  'yẹux': 'yẽu',
  'yẹuj': 'yeuj',

  // yeuz
  'yéuz': 'yeu',
  'yèuz': 'yeu',
  'yẻuz': 'yeu',
  'yẽuz': 'yeu',
  'yẹuz': 'yeu',

  // yêu -> yêu + dấu
  'yêus': 'yếu',
  'yêuf': 'yều',
  'yêur': 'yểu',
  'yêux': 'yễu',
  'yêuj': 'yệu',
  // yeu + dấu (ở e) -> yêu + dấu
  'yéue': 'yếu',
  'yèue': 'yều',
  'yẻue': 'yểu',
  'yẽue': 'yễu',
  'yẹue': 'yệu',

  // yếu
  'yếus': 'yêus',
  'yếuf': 'yều',
  'yếur': 'yểu',
  'yếux': 'yễu',
  'yếuj': 'yệu',

  // yều
  'yềus': 'yếu',
  'yềuf': 'yêuf',
  'yềur': 'yểu',
  'yềux': 'yễu',
  'yềuj': 'yệu',

  // yểu
  'yểus': 'yếu',
  'yểuf': 'yều',
  'yểur': 'yêur',
  'yểux': 'yễu',
  'yểuj': 'yệu',

  // yễu
  'yễus': 'yếu',
  'yễuf': 'yều',
  'yễur': 'yểu',
  'yễux': 'yêux',
  'yễuj': 'yệu',

  // yệu
  'yệus': 'yếu',
  'yệuf': 'yều',
  'yệur': 'yểu',
  'yệux': 'yễu',
  'yệuj': 'yêuj',

  // yêuz
  'yếuz': 'yêu',
  'yềuz': 'yêu',
  'yểuz': 'yêu',
  'yễuz': 'yêu',
  'yệuz': 'yêu',

  //= UAY
  // uay, uây
  'uaya': 'uây',
  'uâya': 'uaya',

  // uay -> uay + dấu (ở a)
  'uays': 'uáy',
  'uayf': 'uày',
  'uayr': 'uảy',
  'uayx': 'uãy',
  'uayj': 'uạy',
  // uây + dấu -> uay + dấu (ở a) + a
  'uấya': 'uáya',
  'uầya': 'uàya',
  'uẩya': 'uảya',
  'uẫya': 'uãya',
  'uậya': 'uạya',

  // uáy
  'uáys': 'uays',
  'uáyf': 'uày',
  'uáyr': 'uảy',
  'uáyx': 'uãy',
  'uáyj': 'uạy',

  // uày
  'uàys': 'uáy',
  'uàyf': 'uayf',
  'uàyr': 'uảy',
  'uàyx': 'uãy',
  'uàyj': 'uạy',

  // uảy
  'uảys': 'uáy',
  'uảyf': 'uày',
  'uảyr': 'uayr',
  'uảyx': 'uãy',
  'uảyj': 'uạy',

  // uãy
  'uãys': 'uáy',
  'uãyf': 'uày',
  'uãyr': 'uảy',
  'uãyx': 'uayx',
  'uãyj': 'uạy',

  // uạy
  'uạys': 'uáy',
  'uạyf': 'uày',
  'uạyr': 'uảy',
  'uạyx': 'uãy',
  'uạyj': 'uayj',

  // uayz
  'uáyz': 'uay',
  'uàyz': 'uay',
  'uảyz': 'uay',
  'uãyz': 'uay',
  'uạyz': 'uay',

  // uây -> uây + dấu
  'uâys': 'uấy',
  'uâyf': 'uầy',
  'uâyr': 'uẩy',
  'uâyx': 'uẫy',
  'uâyj': 'uậy',
  // uay + dấu (ở a) -> uây + dấu
  'uáya': 'uấy',
  'uàya': 'uầy',
  'uảya': 'uẩy',
  'uãya': 'uẫy',
  'uạya': 'uậy',

  // uấy
  'uấys': 'uâys',
  'uấyf': 'uầy',
  'uấyr': 'uẩy',
  'uấyx': 'uẫy',
  'uấyj': 'uậy',

  // uầy
  'uầys': 'uấy',
  'uầyf': 'uâyf',
  'uầyr': 'uẩy',
  'uầyx': 'uẫy',
  'uầyj': 'uậy',

  // uẩy
  'uẩys': 'uấy',
  'uẩyf': 'uầy',
  'uẩyr': 'uâyr',
  'uẩyx': 'uẫy',
  'uẩyj': 'uậy',

  // uẫy
  'uẫys': 'uấy',
  'uẫyf': 'uầy',
  'uẫyr': 'uẩy',
  'uẫyx': 'uâyx',
  'uẫyj': 'uậy',

  // uậy
  'uậys': 'uấy',
  'uậyf': 'uầy',
  'uậyr': 'uẩy',
  'uậyx': 'uẫy',
  'uậyj': 'uâyj',

  // uâyz
  'uấyz': 'uây',
  'uầyz': 'uây',
  'uẩyz': 'uây',
  'uẫyz': 'uây',
  'uậyz': 'uây',

  //= UYA
  // uya

  // uya -> uya + dấu (ở y)
  'uyas': 'uýa',
  'uyaf': 'uỳa',
  'uyar': 'uỷa',
  'uyax': 'uỹa',
  'uyaj': 'uỵa',
  // uy + dấu (ở u) -> uya + dấu (ở y)
  'úya': 'uýa',
  'ùya': 'uỳa',
  'ủya': 'uỷa',
  'ũya': 'uỹa',
  'ụya': 'uỵa',

  // uýa
  'uýas': 'uyas',
  'uýaf': 'uỳa',
  'uýar': 'uỷa',
  'uýax': 'uỹa',
  'uýaj': 'uỵa',

  // uỳa
  'uỳas': 'uýa',
  'uỳaf': 'uyaf',
  'uỳar': 'uỷa',
  'uỳax': 'uỹa',
  'uỳaj': 'uỵa',

  // uỷa
  'uỷas': 'uýa',
  'uỷaf': 'uỳa',
  'uỷar': 'uyar',
  'uỷax': 'uỹa',
  'uỷaj': 'uỵa',

  // uỹa
  'uỹas': 'uýa',
  'uỹaf': 'uỳa',
  'uỹar': 'uỷa',
  'uỹax': 'uyax',
  'uỹaj': 'uỵa',

  // uỵa
  'uỵas': 'uýa',
  'uỵaf': 'uỳa',
  'uỵar': 'uỷa',
  'uỵax': 'uỹa',
  'uỵaj': 'uyaj',

  // uyaz
  'uýaz': 'uya',
  'uỳaz': 'uya',
  'uỷaz': 'uya',
  'uỹaz': 'uya',
  'uỵaz': 'uya',

  //= Uyu
  // uyu

  // uyu -> uyu + dấu (ở y)
  'uyus': 'uýu',
  'uyuf': 'uỳu',
  'uyur': 'uỷu',
  'uyux': 'uỹu',
  'uyuj': 'uỵu',
  // uy + dấu (ở u) -> uyu + dấu (ở y)
  'úyu': 'uýu',
  'ùyu': 'uỳu',
  'ủyu': 'uỷu',
  'ũyu': 'uỹu',
  'ụyu': 'uỵu',

  // uýu
  'uýus': 'uyus',
  'uýuf': 'uỳu',
  'uýur': 'uỷu',
  'uýux': 'uỹu',
  'uýuj': 'uỵu',

  // uỳu
  'uỳus': 'uýu',
  'uỳuf': 'uyuf',
  'uỳur': 'uỷu',
  'uỳux': 'uỹu',
  'uỳuj': 'uỵu',

  // uỷu
  'uỷus': 'uýu',
  'uỷuf': 'uỳu',
  'uỷur': 'uyur',
  'uỷux': 'uỹu',
  'uỷuj': 'uỵu',

  // uỹu
  'uỹus': 'uýu',
  'uỹuf': 'uỳu',
  'uỹur': 'uỷu',
  'uỹux': 'uyux',
  'uỹuj': 'uỵu',

  // uỵu
  'uỵus': 'uýu',
  'uỵuf': 'uỳu',
  'uỵur': 'uỷu',
  'uỵux': 'uỹu',
  'uỵuj': 'uyuj',

  // uyuz
  'uýuz': 'uyu',
  'uỳuz': 'uyu',
  'uỷuz': 'uyu',
  'uỹuz': 'uyu',
  'uỵuz': 'uyu',

  //= UYE
  // uye, uyê
  'uyee': 'uyê',
  'uyêe': 'uyee',

  // uye -> uye + dấu (ở y)
  'uyes': 'uýe',
  'uyef': 'uỳe',
  'uyer': 'uỷe',
  'uyex': 'uỹe',
  'uyej': 'uỵe',
  // uy + dấu (ở u) -> uye + dấu (ở y)
  'úye': 'uýe',
  'ùye': 'uỳe',
  'ủye': 'uỷe',
  'ũye': 'uỹe',
  'ụye': 'uỵe',
  // uyê + dấu -> uye + dấu (ở y) + e
  'uyếe': 'uýee',
  'uyềe': 'uỳee',
  'uyểe': 'uỷee',
  'uyễe': 'uỹee',
  'uyệe': 'uỵee',

  // uýe
  'uýes': 'uyes',
  'uýef': 'uỳe',
  'uýer': 'uỷe',
  'uýex': 'uỹe',
  'uýej': 'uỵe',

  // uỳe
  'uỳes': 'uýe',
  'uỳef': 'uyef',
  'uỳer': 'uỷe',
  'uỳex': 'uỹe',
  'uỳej': 'uỵe',

  // uỷe
  'uỷes': 'uýe',
  'uỷef': 'uỳe',
  'uỷer': 'uyer',
  'uỷex': 'uỹe',
  'uỷej': 'uỵe',

  // uỹe
  'uỹes': 'uýe',
  'uỹef': 'uỳe',
  'uỹer': 'uỷe',
  'uỹex': 'uyex',
  'uỹej': 'uỵe',

  // uỵe
  'uỵes': 'uýe',
  'uỵef': 'uỳe',
  'uỵer': 'uỷe',
  'uỵex': 'uỹe',
  'uỵej': 'uyej',

  // uyez
  'uýez': 'uye',
  'uỳez': 'uye',
  'uỷez': 'uye',
  'uỹez': 'uye',
  'uỵez': 'uye',

  // uyê -> uyê + dấu
  'uyês': 'uyế',
  'uyêf': 'uyề',
  'uyêr': 'uyể',
  'uyêx': 'uyễ',
  'uyêj': 'uyệ',
  // uye + dấu (ở y) -> uyê + dấu
  'uýee': 'uyế',
  'uỳee': 'uyề',
  'uỷee': 'uyể',
  'uỹee': 'uyễ',
  'uỵee': 'uyệ',

  // uyế
  'uyếs': 'uyês',
  'uyếf': 'uyề',
  'uyếr': 'uyể',
  'uyếx': 'uyễ',
  'uyếj': 'uyệ',

  // uyề
  'uyềs': 'uyế',
  'uyềf': 'uyêf',
  'uyềr': 'uyể',
  'uyềx': 'uyễ',
  'uyềj': 'uyệ',

  // uyể
  'uyểs': 'uyế',
  'uyểf': 'uyề',
  'uyểr': 'uyêr',
  'uyểx': 'uyễ',
  'uyểj': 'uyệ',

  // uyễ
  'uyễs': 'uyế',
  'uyễf': 'uyề',
  'uyễr': 'uyể',
  'uyễx': 'uyêx',
  'uyễj': 'uyệ',

  // uyệ
  'uyệs': 'uyế',
  'uyệf': 'uyề',
  'uyệr': 'uyể',
  'uyệx': 'uyễ',
  'uyệj': 'uyêj',

  // uyêz
  'uyếz': 'uyê',
  'uyềz': 'uyê',
  'uyểz': 'uyê',
  'uyễz': 'uyê',
  'uyệz': 'uyê',

  //= UOI
  // uoi, uôi, ươi, (ưo + i = ươi)
  'uoio': 'uôi',
  'ươio': 'uôi',
  'uôio': 'uoio',
  'uoiư': 'ươi',
  'uôiư': 'ươi',
  'ưoi': 'ươi', // *
  'ươiư': 'uoiw',

  // uoi -> uoi + dấu (ở o)
  'uois': 'uói',
  'uoif': 'uòi',
  'uoir': 'uỏi',
  'uoix': 'uõi',
  'uoij': 'uọi',
  // uo + dấu (ở u) -> uoi + dấu (ở o)
  'úoi': 'uói',
  'ùoi': 'uòi',
  'ủoi': 'uỏi',
  'ũoi': 'uõi',
  'ụoi': 'uọi',
  // uôi + dấu -> uoi + dấu (ở o) + o
  'uốio': 'uóio',
  'uồio': 'uòio',
  'uổio': 'uỏio',
  'uỗio': 'uõio',
  'uộio': 'uọio',
  // ươi + dấu -> uoi + dấu (ở o) + w
  'ướiư': 'uóiw',
  'ườiư': 'uòiw',
  'ưởiư': 'uỏiw',
  'ưỡiư': 'uõiw',
  'ượiư': 'uọiw',

  // uói
  'uóis': 'uois',
  'uóif': 'uòi',
  'uóir': 'uỏi',
  'uóix': 'uõi',
  'uóij': 'uọi',

  // uòi
  'uòis': 'uói',
  'uòif': 'uoif',
  'uòir': 'uỏi',
  'uòix': 'uõi',
  'uòij': 'uọi',

  // uỏi
  'uỏis': 'uói',
  'uỏif': 'uòi',
  'uỏir': 'uoir',
  'uỏix': 'uõi',
  'uỏij': 'uọi',

  // uõi
  'uõis': 'uói',
  'uõif': 'uòi',
  'uõir': 'uỏi',
  'uõix': 'uoix',
  'uõij': 'uọi',

  // uọi
  'uọis': 'uói',
  'uọif': 'uòi',
  'uọir': 'uỏi',
  'uọix': 'uõi',
  'uọij': 'uoij',

  // uoiz
  'uóiz': 'uoi',
  'uòiz': 'uoi',
  'uỏiz': 'uoi',
  'uõiz': 'uoi',
  'uọiz': 'uoi',

  // uôi -> uôi + dấu
  'uôis': 'uối',
  'uôif': 'uồi',
  'uôir': 'uổi',
  'uôix': 'uỗi',
  'uôij': 'uội',
  // uoi + dấu (ở o) -> uôi + dấu
  'uóio': 'uối',
  'uòio': 'uồi',
  'uỏio': 'uổi',
  'uõio': 'uỗi',
  'uọio': 'uội',
  // ươi + dấu -> uôi + dấu
  'ướio': 'uối',
  'ườio': 'uồi',
  'ưởio': 'uổi',
  'ưỡio': 'uỗi',
  'ượio': 'uội',

  // uối
  'uốis': 'uôis',
  'uốif': 'uồi',
  'uốir': 'uổi',
  'uốix': 'uỗi',
  'uốij': 'uội',

  // uồi
  'uồis': 'uối',
  'uồif': 'uôif',
  'uồir': 'uổi',
  'uồix': 'uỗi',
  'uồij': 'uội',

  // uổi
  'uổis': 'uối',
  'uổif': 'uồi',
  'uổir': 'uôir',
  'uổix': 'uỗi',
  'uổij': 'uội',

  // uỗi
  'uỗis': 'uối',
  'uỗif': 'uồi',
  'uỗir': 'uổi',
  'uỗix': 'uôix',
  'uỗij': 'uội',

  // uội
  'uộis': 'uối',
  'uộif': 'uồi',
  'uộir': 'uổi',
  'uộix': 'uỗi',
  'uộij': 'uôij',

  // uôiz
  'uốiz': 'uôi',
  'uồiz': 'uôi',
  'uổiz': 'uôi',
  'uỗiz': 'uôi',
  'uộiz': 'uôi',

  // ươi -> ươi + dấu
  'ươis': 'ưới',
  'ươif': 'ười',
  'ươir': 'ưởi',
  'ươix': 'ưỡi',
  'ươij': 'ượi',
  // uoi + dấu (ở o) -> ươi + dấu
  'uóiư': 'ưới',
  'uòiư': 'ười',
  'uỏiư': 'ưởi',
  'uõiư': 'ưỡi',
  'uọiư': 'ượi',
  // uôi + dấu -> ươi + dấu
  'uốiư': 'ưới',
  'uồiư': 'ười',
  'uổiư': 'ưởi',
  'uỗiư': 'ưỡi',
  'uộiư': 'ượi',
  // ưo + dấu -> ươi + dấu // *
  'ứoi': 'ưới',
  'ừoi': 'ười',
  'ửoi': 'ưởi',
  'ữoi': 'ưỡi',
  'ựoi': 'ượi',

  // ưới
  'ướis': 'ươis',
  'ướif': 'ười',
  'ướir': 'ưởi',
  'ướix': 'ưỡi',
  'ướij': 'ượi',

  // ười
  'ườis': 'ưới',
  'ườif': 'ươif',
  'ườir': 'ưởi',
  'ườix': 'ưỡi',
  'ườij': 'ượi',

  // ưởi
  'ưởis': 'ưới',
  'ưởif': 'ười',
  'ưởir': 'ươir',
  'ưởix': 'ưỡi',
  'ưởij': 'ượi',

  // ưỡi
  'ưỡis': 'ưới',
  'ưỡif': 'ười',
  'ưỡir': 'ưởi',
  'ưỡix': 'ươix',
  'ưỡij': 'ượi',

  // ượi
  'ượis': 'ưới',
  'ượif': 'ười',
  'ượir': 'ưởi',
  'ượix': 'ưỡi',
  'ượij': 'ươij',

  // ươiz
  'ướiz': 'ươi',
  'ườiz': 'ươi',
  'ưởiz': 'ươi',
  'ưỡiz': 'ươi',
  'ượiz': 'ươi',

  //= UOU
  // uou, ươu, (ưo + u = ươu)
  'uouư': 'ươu',
  'ưou': 'ươu',
  'ươuư': 'uouw',

  // uou -> uou + dấu (ở o)
  'uous': 'uóu',
  'uouf': 'uòu',
  'uour': 'uỏu',
  'uoux': 'uõu',
  'uouj': 'uọu',
  // uo + dấu (ở u) -> uou + dấu (ở o)
  'úou': 'uóu',
  'ùou': 'uòu',
  'ủou': 'uỏu',
  'ũou': 'uõu',
  'ụou': 'uọu',
  // ươu + dấu -> uou + dấu (ở o) + w
  'ướuư': 'uóuw',
  'ườuư': 'uòuw',
  'ưởuư': 'uỏuw',
  'ưỡuư': 'uõuw',
  'ượuư': 'uọuw',

  // uóu
  'uóus': 'uous',
  'uóuf': 'uòu',
  'uóur': 'uỏu',
  'uóux': 'uõu',
  'uóuj': 'uọu',

  // uòu
  'uòus': 'uóu',
  'uòuf': 'uouf',
  'uòur': 'uỏu',
  'uòux': 'uõu',
  'uòuj': 'uọu',

  // uỏu
  'uỏus': 'uóu',
  'uỏuf': 'uòu',
  'uỏur': 'uour',
  'uỏux': 'uõu',
  'uỏuj': 'uọu',

  // uõu
  'uõus': 'uóu',
  'uõuf': 'uòu',
  'uõur': 'uỏu',
  'uõux': 'uoux',
  'uõuj': 'uọu',

  // uọu
  'uọus': 'uóu',
  'uọuf': 'uòu',
  'uọur': 'uỏu',
  'uọux': 'uõu',
  'uọuj': 'uouj',

  // uouz
  'uóuz': 'uouz',
  'uòuz': 'uouz',
  'uỏuz': 'uouz',
  'uõuz': 'uouz',
  'uọuz': 'uouz',

  // ươu -> ươu + dấu
  'ươus': 'ướu',
  'ươuf': 'ườu',
  'ươur': 'ưởu',
  'ươux': 'ưỡu',
  'ươuj': 'ượu',
  // uou + dấu (ở o) -> ươu + dấu
  'uóuư': 'ướu',
  'uòuư': 'ườu',
  'uỏuư': 'ưởu',
  'uõuư': 'ưỡu',
  'uọuư': 'ượu',
  // ưo + dấu -> ươu + dấu
  'ứou': 'ướu',
  'ừou': 'ườu',
  'ửou': 'ưởu',
  'ữou': 'ưỡu',
  'ựou': 'ượu',

  // ướu
  'ướus': 'ươus',
  'ướuf': 'ườu',
  'ướur': 'ưởu',
  'ướux': 'ưỡu',
  'ướuj': 'ượu',

  // ườu
  'ườus': 'ướu',
  'ườuf': 'ươuf',
  'ườur': 'ưởu',
  'ườux': 'ưỡu',
  'ườuj': 'ượu',

  // ưởu
  'ưởus': 'ướu',
  'ưởuf': 'ườu',
  'ưởur': 'ươur',
  'ưởux': 'ưỡu',
  'ưởuj': 'ượu',

  // ưỡu
  'ưỡus': 'ướu',
  'ưỡuf': 'ườu',
  'ưỡur': 'ưởu',
  'ưỡux': 'ươux',
  'ưỡuj': 'ượu',

  // ượu
  'ượus': 'ướu',
  'ượuf': 'ườu',
  'ượur': 'ưởu',
  'ượux': 'ưỡu',
  'ượuj': 'ươuj',

  // ươuz
  'ướuz': 'ươu',
  'ườuz': 'ươu',
  'ưởuz': 'ươu',
  'ưỡuz': 'ươu',
  'ượuz': 'ươu',

  //= OAI
  // oai

  // oai -> oai + dấu (ở a)
  'oais': 'oái',
  'oaif': 'oài',
  'oair': 'oải',
  'oaix': 'oãi',
  'oaij': 'oại',
  // oa + dấu (ở o) -> oai + dấu (ở a)
  'óai': 'oái',
  'òai': 'oài',
  'ỏai': 'oải',
  'õai': 'oãi',
  'ọai': 'oại',

  // oái
  'oáis': 'oais',
  'oáif': 'oài',
  'oáir': 'oải',
  'oáix': 'oãi',
  'oáij': 'oại',

  // oài
  'oàis': 'oái',
  'oàif': 'oaif',
  'oàir': 'oải',
  'oàix': 'oãi',
  'oàij': 'oại',

  // oải
  'oảis': 'oái',
  'oảif': 'oài',
  'oảir': 'oair',
  'oảix': 'oãi',
  'oảij': 'oại',

  // oãi
  'oãis': 'oái',
  'oãif': 'oài',
  'oãir': 'oải',
  'oãix': 'oaix',
  'oãij': 'oại',

  // oại
  'oạis': 'oái',
  'oạif': 'oài',
  'oạir': 'oải',
  'oạix': 'oãi',
  'oạij': 'oaij',

  // oaiz
  'oáiz': 'oai',
  'oàiz': 'oai',
  'oảiz': 'oai',
  'oãiz': 'oai',
  'oạiz': 'oai',

  //= OAY
  // oay

  // oay -> oay + dấu (ở a)
  'oays': 'oáy',
  'oayf': 'oày',
  'oayr': 'oảy',
  'oayx': 'oãy',
  'oayj': 'oạy',
  // oa + dấu (ở o) -> oay + dấu (ở a)
  'óay': 'oáy',
  'òay': 'oày',
  'ỏay': 'oảy',
  'õay': 'oãy',
  'ọay': 'oạy',

  // oáy
  'oáys': 'oays',
  'oáyf': 'oày',
  'oáyr': 'oảy',
  'oáyx': 'oãy',
  'oáyj': 'oạy',

  // oày
  'oàys': 'oáy',
  'oàyf': 'oayf',
  'oàyr': 'oảy',
  'oàyx': 'oãy',
  'oàyj': 'oạy',

  // oảy
  'oảys': 'oáy',
  'oảyf': 'oày',
  'oảyr': 'oayr',
  'oảyx': 'oãy',
  'oảyj': 'oạy',

  // oãy
  'oãys': 'oáy',
  'oãyf': 'oày',
  'oãyr': 'oảy',
  'oãyx': 'oayx',
  'oãyj': 'oạy',

  // oạy
  'oạys': 'oáy',
  'oạyf': 'oày',
  'oạyr': 'oảy',
  'oạyx': 'oãy',
  'oạyj': 'oayj',

  // oayz
  'oáyz': 'oay',
  'oàyz': 'oay',
  'oảyz': 'oay',
  'oãyz': 'oay',
  'oạyz': 'oay',

  //= OEO
  // oeo

  // oeo -> oeo + dấu (ở e)
  'oeos': 'oéo',
  'oeof': 'oèo',
  'oeor': 'oẻo',
  'oeox': 'oẽo',
  'oeoj': 'oẹo',
  // oe + dấu (ở o) -> oeo + dấu (ở e)
  'óeo': 'oéo',
  'òeo': 'oèo',
  'ỏeo': 'oẻo',
  'õeo': 'oẽo',
  'ọeo': 'oẹo',

  // oéo
  'oéos': 'oeos',
  'oéof': 'oèo',
  'oéor': 'oẻo',
  'oéox': 'oẽo',
  'oéoj': 'oẹo',

  // oèo
  'oèos': 'oéo',
  'oèof': 'oeof',
  'oèor': 'oẻo',
  'oèox': 'oẽo',
  'oèoj': 'oẹo',

  // oẻo
  'oẻos': 'oéo',
  'oẻof': 'oèo',
  'oẻor': 'oeor',
  'oẻox': 'oẽo',
  'oẻoj': 'oẹo',

  // oẽo
  'oẽos': 'oéo',
  'oẽof': 'oèo',
  'oẽor': 'oẻo',
  'oẽox': 'oeox',
  'oẽoj': 'oẹo',

  // oẹo
  'oẹos': 'oéo',
  'oẹof': 'oèo',
  'oẹor': 'oẻo',
  'oẹox': 'oẽo',
  'oẹoj': 'oeoj',

  // oeoz
  'oéoz': 'oeo',
  'oèoz': 'oeo',
  'oẻoz': 'oeo',
  'oẽoz': 'oeo',
  'oẹoz': 'oeo',
};

/// Helper map to convert from vowel to new vowel+consonant after insertion
const vowelToVowelWithTrailingConsonant = <String, String>{
  //= ua
  'úa': 'uá',
  'ùa': 'uà',
  'ủa': 'uả',
  'ũa': 'uã',
  'ụa': 'uạ',

  //= uy
  'úy': 'uý',
  'ùy': 'uỳ',
  'ủy': 'uỷ',
  'ũy': 'uỹ',
  'ụy': 'uỵ',

  //= uo
  'úo': 'uó',
  'ùo': 'uò',
  'ủo': 'uỏ',
  'ũo': 'uõ',
  'ụo': 'uọ',

  //= ưo
  'ưo': 'ươ',
  'ứo': 'ướ',
  'ừo': 'ườ',
  'ửo': 'ưở',
  'ữo': 'ưỡ',
  'ựo': 'ượ',

  //= oa
  'óa': 'oá',
  'òa': 'oà',
  'ỏa': 'oả',
  'õa': 'oã',
  'ọa': 'oạ',

  //= oe
  'óe': 'oé',
  'òe': 'oè',
  'ỏe': 'oẻ',
  'õe': 'oẽ',
  'ọe': 'oẹ',
};

/// Helper map to convert from vowel+modifier to new vowel+consonant after
/// insertion
const vowelAndModifierToVowelWithTrailingConsonant = <String, String>{
  //= UA
  // ua, uâ, ưa
  'uaa': 'uâ',
  'uâa': 'uaa',
  'uaư': 'ưa',
  'ưaư': 'uaw',

  // ua -> ua + dấu (ở a)
  'uas': 'uá',
  'uaf': 'uà',
  'uar': 'uả',
  'uax': 'uã',
  'uaj': 'uạ',
  // uâ + dấu -> ua + dấu (ở a) + a
  'uấa': 'uáa',
  'uầa': 'uàa',
  'uẩa': 'uảa',
  'uẫa': 'uãa',
  'uậa': 'uạa',
  // ưa + dấu -> ua + dấu (ở a) + w
  'ứaư': 'uáw',
  'ừaư': 'uàw',
  'ửaư': 'uảw',
  'ữaư': 'uãw',
  'ựaư': 'uạw',

  // uá
  'uás': 'uas',
  'uáf': 'uà',
  'uár': 'uả',
  'uáx': 'uã',
  'uáj': 'uạ',

  // uà
  'uàs': 'uá',
  'uàf': 'uaf',
  'uàr': 'uả',
  'uàx': 'uã',
  'uàj': 'uạ',

  // uả
  'uảs': 'uá',
  'uảf': 'uà',
  'uảr': 'uar',
  'uảx': 'uã',
  'uảj': 'uạ',

  // uã
  'uãs': 'uá',
  'uãf': 'uà',
  'uãr': 'uả',
  'uãx': 'uax',
  'uãj': 'uạ',

  // uạ
  'uạs': 'uá',
  'uạf': 'uà',
  'uạr': 'uả',
  'uạx': 'uã',
  'uạj': 'uaj',

  // uaz
  'uáz': 'ua',
  'uàz': 'ua',
  'uảz': 'ua',
  'uãz': 'ua',
  'uạz': 'ua',

  // uâ -> uâ + dấu (not necessary)
  // ua + dấu (ở a) -> uâ + dấu
  'uáa': 'uấ',
  'uàa': 'uầ',
  'uảa': 'uẩ',
  'uãa': 'uẫ',
  'uạa': 'uậ',
  // ứa + dấu -> uâ + dấu (không có)

  // uấ
  'uấs': 'uâs',

  // uầ
  'uầf': 'uâf',

  // uẩ
  'uẩr': 'uâr',

  // uẫ
  'uẫx': 'uâx',

  // uậ
  'uậj': 'uâj',

  // uâz (not necessary)

  // ưa -> ưa + dấu (not necessary)
  // ua + dấu (ở a) -> ưa + dấu
  'uáư': 'ứa',
  'uàư': 'ừa',
  'uảư': 'ửa',
  'uãư': 'ữa',
  'uạư': 'ựa',
  // uâ + dấu -> ưa + dấu (không có)

  // ứa
  'ứas': 'ưas',

  // ừa
  'ừaf': 'ưaf',

  // ửa
  'ửar': 'ưar',

  // ữa
  'ữax': 'ưax',

  // ựa
  'ựaj': 'ưaj',

  // ưaz (not necessary)

  //= UY
  // uy

  // uy -> uy + dấu (ở y)
  'uys': 'uý',
  'uyf': 'uỳ',
  'uyr': 'uỷ',
  'uyx': 'uỹ',
  'uyj': 'uỵ',

  // uý
  'uýs': 'uys',
  'uýf': 'uỳ',
  'uýr': 'uỷ',
  'uýx': 'uỹ',
  'uýj': 'uỵ',

  // uỳ
  'uỳs': 'uý',
  'uỳf': 'uyf',
  'uỳr': 'uỷ',
  'uỳx': 'uỹ',
  'uỳj': 'uỵ',

  // uỷ
  'uỷs': 'uý',
  'uỷf': 'uỳ',
  'uỷr': 'uyr',
  'uỷx': 'uỹ',
  'uỷj': 'uỵ',

  // uỹ
  'uỹs': 'uý',
  'uỹf': 'uỳ',
  'uỹr': 'uỷ',
  'uỹx': 'uyx',
  'uỹj': 'uỵ',

  // uỵ
  'uỵs': 'uý',
  'uỵf': 'uỳ',
  'uỵr': 'uỷ',
  'uỵx': 'uỹ',
  'uỵj': 'uyj',

  // uyz
  'uýz': 'uy',
  'uỳz': 'uy',
  'uỷz': 'uy',
  'uỹz': 'uy',
  'uỵz': 'uy',

  //= UO
  // uo, uô, ươ, ưo (uwo)
  'uoo': 'uô',
  'ươo': 'uô',
  'ưoo': 'uô',
  'uôo': 'uoo',
  'uoư': 'ươ',
  'ưoư': 'ươ',
  'uôư': 'ươ',
  'ươư': 'uow',

  // uo -> uo + dấu (ở o)
  'uos': 'uó',
  'uof': 'uò',
  'uor': 'uỏ',
  'uox': 'uõ',
  'uoj': 'uọ',
  // uô + dấu -> uo + dấu (ở o) + o
  'uốo': 'uóo',
  'uồo': 'uòo',
  'uổo': 'uỏo',
  'uỗo': 'uõo',
  'uộo': 'uọo',
  // ươ + dấu -> uo + dấu (ở o) + w
  'ướư': 'uów',
  'ườư': 'uòw',
  'ưởư': 'uỏw',
  'ưỡư': 'uõw',
  'ượư': 'uọw',

  // uó
  'uós': 'uos',
  'uóf': 'uò',
  'uór': 'uỏ',
  'uóx': 'uõ',
  'uój': 'uọ',

  // uò
  'uòs': 'uó',
  'uòf': 'uof',
  'uòr': 'uỏ',
  'uòx': 'uõ',
  'uòj': 'uọ',

  // uỏ
  'uỏs': 'uó',
  'uỏf': 'uò',
  'uỏr': 'uor',
  'uỏx': 'uõ',
  'uỏj': 'uọ',

  // uõ
  'uõs': 'uó',
  'uõf': 'uò',
  'uõr': 'uỏ',
  'uõx': 'uox',
  'uõj': 'uọ',

  // uọ
  'uọs': 'uó',
  'uọf': 'uò',
  'uọr': 'uỏ',
  'uọx': 'uõ',
  'uọj': 'uoj',

  // uoz
  'uóz': 'uo',
  'uòz': 'uo',
  'uỏz': 'uo',
  'uõz': 'uo',
  'uọz': 'uo',

  // uô -> uô + dấu (not necessary)
  // uo + dấu (ở o) -> uô + dấu
  'úoo': 'uố',
  'ùoo': 'uồ',
  'ủoo': 'uổ',
  'ũoo': 'uỗ',
  'ụoo': 'uộ',
  // ươ + dấu -> uô + dấu (not necessary)
  // ưo + dấu -> uô + dấu (not necessary)

  // uố
  'uốs': 'uôs',

  // uồ
  'uồf': 'uôf',

  // uổ
  'uổr': 'uôr',

  // uỗ
  'uỗx': 'uôx',

  // uộ
  'uộj': 'uôj',

  // uôz (not necessary)

  // ươ -> ươ + dấu (not necessary)
  // uo + dấu (ở o) -> ươ + dấu
  'uóư': 'ướ',
  'uòư': 'ườ',
  'uỏư': 'ưở',
  'uõư': 'ưỡ',
  'uọư': 'ượ',
  // uô + dấu -> ươ + dấu (not necessary)
  // ưo + dấu -> ươ + dấu (not necessary)

  // ướ
  'ướs': 'ươs',

  // ườ
  'ườf': 'ươf',

  // ưở
  'ưởr': 'ươr',

  // ưỡ
  'ưỡx': 'ươx',

  // ượ
  'ượj': 'ươj',

  // ươz (not necessary)

  // ưo -> ưo + dấu (not necessary)

  // ứo
  'ứos': 'ưos',

  // ừo
  'ừof': 'ưof',

  // ửo
  'ửor': 'ưor',

  // ữo
  'ữox': 'ưox',

  // ựo
  'ựoj': 'ưoj',

  // ưoz (has a special one - the last one)
  'ưoz': 'ươz',

  //= OA
  // oa, oă
  'oaư': 'oă',
  'oăư': 'oaw',

  // oa -> oa + dấu (ở a)
  'oas': 'oá',
  'oaf': 'oà',
  'oar': 'oả',
  'oax': 'oã',
  'oaj': 'oạ',
  // oă + dấu -> oa + dấu (ở a) + w
  'oắư': 'oáw',
  'oằư': 'oàw',
  'oẳư': 'oảw',
  'oẵư': 'oãw',
  'oặư': 'oạw',

  // oá
  'oás': 'oas',
  'oáf': 'oà',
  'oár': 'oả',
  'oáx': 'oã',
  'oáj': 'oạ',

  // oà
  'oàs': 'oá',
  'oàf': 'oaf',
  'oàr': 'oả',
  'oàx': 'oã',
  'oàj': 'oạ',

  // oả
  'oảs': 'oá',
  'oảf': 'oà',
  'oảr': 'oar',
  'oảx': 'oã',
  'oảj': 'oạ',

  // oã
  'oãs': 'oá',
  'oãf': 'oà',
  'oãr': 'oả',
  'oãx': 'oax',
  'oãj': 'oạ',

  // oạ
  'oạs': 'oá',
  'oạf': 'oà',
  'oạr': 'oả',
  'oạx': 'oã',
  'oạj': 'oaj',

  // oaz
  'oáz': 'oa',
  'oàz': 'oa',
  'oảz': 'oa',
  'oãz': 'oa',
  'oạz': 'oa',

  // oă -> oă + dấu (not necessary)
  // oa + dấu (ở a) -> oă + dấu
  'oáư': 'oắ',
  'oàư': 'oằ',
  'oảư': 'oẳ',
  'oãư': 'oẵ',
  'oạư': 'oặ',

  // oắ
  'oắs': 'oăs',

  // oằ
  'oằf': 'oăf',

  // oẳ
  'oẳr': 'oăr',

  // oẵ
  'oẵx': 'oăx',

  // oặ
  'oặj': 'oăj',

  // oăz (not necessary)

  //= OE
  // oe

  // oe -> oe + dấu (ở e)
  'oes': 'oé',
  'oef': 'oè',
  'oer': 'oẻ',
  'oex': 'oẽ',
  'oej': 'oẹ',

  // oé
  'oés': 'oes',
  'oéf': 'oè',
  'oér': 'oẻ',
  'oéx': 'oẽ',
  'oéj': 'oẹ',

  // oè
  'oès': 'oé',
  'oèf': 'oef',
  'oèr': 'oẻ',
  'oèx': 'oẽ',
  'oèj': 'oẹ',

  // oẻ
  'oẻs': 'oé',
  'oẻf': 'oè',
  'oẻr': 'oer',
  'oẻx': 'oẽ',
  'oẻj': 'oẹ',

  // oẽ
  'oẽs': 'oé',
  'oẽf': 'oè',
  'oẽr': 'oẻ',
  'oẽx': 'oex',
  'oẽj': 'oẹ',

  // oẹ
  'oẹs': 'oé',
  'oẹf': 'oè',
  'oẹr': 'oẻ',
  'oẹx': 'oẽ',
  'oẹj': 'oej',

  // oez
  'oéz': 'oe',
  'oèz': 'oe',
  'oẻz': 'oe',
  'oẽz': 'oe',
  'oẹz': 'oe',
};

/// Helper map to convert from vowel to new vowel after deletion
const vowelAfterDeletionToVowel = <String, String>{
  //= ua
  'uá': 'úa',
  'uà': 'ùa',
  'uả': 'ủa',
  'uã': 'ũa',
  'uạ': 'ụa',

  //= uy
  'uý': 'úy',
  'uỳ': 'ùy',
  'uỷ': 'ủy',
  'uỹ': 'ũy',
  'uỵ': 'ụy',

  //= uo
  'uó': 'úo',
  'uò': 'ùo',
  'uỏ': 'ủo',
  'uõ': 'ũo',
  'uọ': 'ụo',

  //= oa
  'oá': 'óa',
  'oà': 'òa',
  'oả': 'ỏa',
  'oã': 'õa',
  'oạ': 'ọa',

  //= oe
  'oé': 'óe',
  'oè': 'òe',
  'oẻ': 'ỏe',
  'oẽ': 'õe',
  'oẹ': 'ọe',
};

/// Helper map to convert from 'gi' to new 'gi' after insertion
const giAndModifierToGi = <String, String>{
  // gi -> gi + dấu
  'gis': 'gí',
  'gif': 'gì',
  'gir': 'gỉ',
  'gix': 'gĩ',
  'gij': 'gị',

  // gí
  'gís': 'gis',
  'gíf': 'gì',
  'gír': 'gỉ',
  'gíx': 'gĩ',
  'gíj': 'gị',

  // gì
  'gìs': 'gí',
  'gìf': 'gif',
  'gìr': 'gỉ',
  'gìx': 'gĩ',
  'gìj': 'gị',

  // gỉ
  'gỉs': 'gí',
  'gỉf': 'gì',
  'gỉr': 'gir',
  'gỉx': 'gĩ',
  'gỉj': 'gị',

  // gĩ
  'gĩs': 'gí',
  'gĩf': 'gì',
  'gĩr': 'gỉ',
  'gĩx': 'gix',
  'gĩj': 'gị',

  // gị
  'gịs': 'gí',
  'gịf': 'gì',
  'gịr': 'gỉ',
  'gịx': 'gĩ',
  'gịj': 'gị',

  // giz
  'gíz': 'gi',
  'gìz': 'gi',
  'gỉz': 'gi',
  'gĩz': 'gi',
  'gịz': 'gi',
};

/// Helper map to convert from 'gi'+modifier to new 'gi'+vowel after insertion
const giAndModifierToGiAndVowel = <String, String>{
  // gí
  'gía': 'giá',
  'gíu': 'giú',
  'gíe': 'gié',
  'gío': 'gió',

  // gì
  'gìa': 'già',
  'gìu': 'giù',
  'gìe': 'giè',
  'gìo': 'giò',

  // gỉ
  'gỉa': 'giả',
  'gỉu': 'giủ',
  'gỉe': 'giẻ',
  'gỉo': 'giỏ',

  // gĩ
  'gĩa': 'giã',
  'gĩu': 'giũ',
  'gĩe': 'giẽ',
  'gĩo': 'giõ',

  // gị
  'gịa': 'giạ',
  'gịu': 'giụ',
  'gịe': 'giẹ',
  'gịo': 'giọ',
};
